[
    {
        "title": "Ambient social tv: drawing people into a shared experience",
        "authors": "Gunnar Harboe, Crysta J. Metcalf, Frank Bentley, Joe Tullio, Noel Massey, Guy Romano",
        "abstract": "We examine how ambient displays can augment social television. Social TV 2 is an interactive television solution that incorporates two ambient displays to convey to participants an aggregate view of their friends' current TV-watching status. Social TV 2 also allows users to see which television shows friends and family are watching and send lightweight messages from within the TV-viewing experience. Through a two-week field study we found the ambient displays to be an integral part of the experience. We present the results of our field study with a discussion of the implications for future social systems in the home.",
        "session": "SESSION: Socio-Cultural Impact"
    },
    {
        "title": "Re-placing faith: reconsidering the secular-religious use divide in the United States and Kenya",
        "authors": "Susan P. Wyche, Paul M. Aoki, Rebecca E. Grinter",
        "abstract": "",
        "session": "SESSION: Socio-Cultural Impact"
    },
    {
        "title": "From meiwaku to tokushita!: lessons for digital money design from japan",
        "authors": "Scott Mainwaring, Wendy March, Bill Maurer",
        "abstract": "",
        "session": "SESSION: Socio-Cultural Impact"
    },
    {
        "title": "Human-Currency Interaction: learning from virtual currency use in China",
        "authors": "Yang Wang, Scott D. Mainwaring",
        "abstract": "",
        "session": "SESSION: Socio-Cultural Impact"
    },
    {
        "title": "CueFlik: interactive concept learning in image search",
        "authors": "James Fogarty, Desney Tan, Ashish Kapoor, Simon Winder",
        "abstract": "Web image search is difficult in part because a handful of keywords are generally insufficient for characterizing the visual properties of an image. Popular engines have begun to provide tags based on simple characteristics of images (such as tags for black and white images or images that contain a face), but such approaches are limited by the fact that it is unclear what tags end users want to be able to use in examining Web image search results. This paper presents CueFlik, a Web image search application that allows end users to quickly create their own rules for re ranking images based on their visual characteristics. End users can then re rank any future Web image search results according to their rule. In an experiment we present in this paper, end users quickly create effective rules for such concepts as \"product photos\", \"portraits of people\", and \"clipart\". When asked to conceive of and create their own rules, participants create such rules as \"sports action shot\" with images from queries for \"basketball\" and \"football\". CueFlik represents both a promising new approach to Web image search and an important study in end user interactive machine learning.",
        "session": "SESSION: Interactive Image Search"
    },
    {
        "title": "Knowledge in the head and on the web: using topic expertise to aid search",
        "authors": "Geoffrey B. Duggan, Stephen J. Payne",
        "abstract": "The importance of background knowledge for effective searching on the Web is not well understood. Participants were given trivia questions on two topics and asked to answer them first using background knowledge and second by searching on the Web. Knowledge of a topic predicted search performance on that topic for all questions and, more importantly, for questions for which participants did not already know the answer. In terms of process, greater topic knowledge led to less time being spent on each Webpage, faster decisions to give up a line of inquiry and shorter queries being entered into the search engine. A more complete theory-led understanding of these effects would assist workers in a whole range of Web-related professions.",
        "session": "SESSION: Interactive Image Search"
    },
    {
        "title": "MQSearch: image search by multi-class query",
        "authors": "Yiwen Luo, Wei Liu, Jianzhuang Liu, Xiaoou Tang",
        "abstract": "Image search is becoming prevalent in web search as the number of digital photos grows exponentially on the internet. For a successful image search system, removing outliers in the top ranked results is a challenging task. Typical content based image search engines take an input image from one class as a query and compute relevance between the query and images in a database. The results often contain a large number of outliers, since these outliers may be similar to the query image in some way. In this paper we present a novel search scheme using query images from multiple classes. Instead of conducting query search for one image class at a time, we conduct multi-class query search jointly. By using several query classes that are similar to each other for multi-class query, we can utilize information across similar classes to fine tune the similarity measure to remove outliers. This strategy can be used for any information search application. In this work, we use content based image search to illustrate the concept.",
        "session": "SESSION: Interactive Image Search"
    },
    {
        "title": "AutoTopography: what can physical mementos tell us about digital memories?",
        "authors": "Daniela Petrelli, Steve Whittaker, Jens Brockmeier",
        "abstract": "Current technology makes it possible to capture huge amounts of information related to everyday experiences. Despite this, we know little about the processes by which people identify and manage mementos - objects which are directly meaningful to their memories. Among the millions of objects people encounter in a lifetime, few become such reminders of people, places or events. We report fieldwork where participants gave us a tour of their homes describing how and why particular objects become mementos. Our findings extend the existing digital memory literature; first our participants didn't view their activities as experiential 'capture', nor were mementos limited to pictorial representations of people and events; instead they included everyday objects. Furthermore, mementos were not only displayed and shared, but also integrated into everyday activities. Finally there were complex relations between house location and memento type. We discuss the theoretical and technical implications of our work.",
        "session": "SESSION: Stories and Memories"
    },
    {
        "title": "Mobile multimedia presentation editor: enabling creation of audio-visual stories on mobile devices",
        "authors": "Tero Jokela, Jaakko T. Lehikoinen, Hannu Korhonen",
        "abstract": "A mobile device provides an attractive tool for creating and sharing audio-visual stories. Earlier research has shown that the users enjoy creating digital stories with their mobile devices. However, designing editor interfaces that support creation of rich audio-visual presentations has been a major challenge due to the constrained input and output capabilities of mobile devices. In this paper, we present the design and evaluation of the Mobile Multimedia Presentation Editor, an application that makes it possible to author sophisticated multimedia presentations that integrate several different media types on mobile devices. Based on a user study, we present design principles for multimedia presentation editors on mobile devices. We describe an application design that supports these principles and so demonstrate that editing of sophisticated multimedia presentations is feasible on mobile devices. We report evaluations which indicate that the editor application was easy to use and supported the creativity of the mobile users well.",
        "session": "SESSION: Stories and Memories"
    },
    {
        "title": "Temporal trajectories in shared interactive narratives",
        "authors": "Steve Benford, Gabriella Giannachi",
        "abstract": "Temporal trajectories can represent the complex mappings between story time and clock time that are to be found in shared interactive narratives such as computer games and interactive performances. There are three kinds. Canonical trajectories express an author's intended mapping of story time onto clock time as part of the plot and schedule of an experience. Participant trajectories reflect a participant's actual journey through story time and clock time as they interact with the experience. Historic trajectories represent the subsequent selection and reuse of segments of recorded participant trajectories to create histories of past events. We show how temporal trajectories help us analyse the nature of time in existing experiences and can also generate new approaches to dealing with temporal issues such as: disengagement and reengagement, adapting to different paces of interaction, synchronising different participants, and enabling encounters and travel across time.",
        "session": "SESSION: Stories and Memories"
    },
    {
        "title": "Communication chains and multitasking",
        "authors": "Norman Makoto Su, Gloria Mark",
        "abstract": "There is a growing literature on managing multitasking and interruptions in the workplace. In an ethnographic study, we investigated the phenomenon of communication chains, the occurrence of interactions in quick succession. Focusing on chains enable us to better understand the role of communication in multitasking. Our results reveal that chains are prevalent in information workers, and that attributes such as the number of links, and the rate of media and organizational switching can be predicted from the first catalyzing link of the chain. When chains are triggered by external interruptions, they have more links, a trend for more media switches and more organizational switches. We also found that more switching of organizational contexts in communication is associated with higher levels of stress. We describe the role of communication chains as performing alignment in multitasking and discuss the implications of our results.",
        "session": "SESSION: Don't Interrupt Me"
    },
    {
        "title": "Effects of intelligent notification management on users and their tasks",
        "authors": "Shamsi T. Iqbal, Brian P. Bailey",
        "abstract": "We present a novel system for notification management and report results from two studies testing its performance and impact. The system uses statistical models to realize defer-to-breakpoint policies for managing notifications. The first study tested how well the models detect three types of breakpoints within novel task sequences. Results show that the models detect breakpoints reasonably well, but struggle to differentiate their type. Our second study explored effects of managing notifications with our system on users and their tasks. Results showed that scheduling notifications at breakpoints reduces frustration and reaction time relative to delivering them immediately. We also found that the relevance of notification content determines the type of breakpoint at which it should be delivered. The core concept of scheduling notifications at breakpoints fits well with how users prefer notifications to be managed. This indicates that users would likely adopt the use of notification management systems in practice.",
        "session": "SESSION: Don't Interrupt Me"
    },
    {
        "title": "Attention by proxy? issues in audience awareness for webcasts to distributed groups",
        "authors": "Jeremy Birnholtz, Clarissa Mak, Saul Greenberg, Ron Baecker",
        "abstract": "Instructor/student interaction in e-learning environments can positively impact both student learning and instructor satisfaction. In online webcast lectures, however, interaction can be difficult because instructors lack basic awareness information about their remote students. Our goal is to better understand the kinds of awareness information that instructors should have if they are to interact frequently and effectively with their students in e-learning environments. We conducted an exploratory study -- via interviews and observations -- of instructor attention in face-to-face classrooms at a large university. Our results imply that a webcast system should provide instructors with overview and detailed data about their students, but that this detailed information should not be displayed publicly.",
        "session": "SESSION: Don't Interrupt Me"
    },
    {
        "title": "The cost of interrupted work: more speed and stress",
        "authors": "Gloria Mark, Daniela Gudith, Ulrich Klocke",
        "abstract": "We performed an empirical study to investigate whether the context of interruptions makes a difference. We found that context does not make a difference but surprisingly, people completed interrupted tasks in less time with no difference in quality. Our data suggests that people compensate for interruptions by working faster, but this comes at a price: experiencing more stress, higher frustration, time pressure and effort. Individual differences exist in the management of interruptions: personality measures of openness to experience and need for personal structure predict disruption costs of interruptions. We discuss implications for how system design can support interrupted work.",
        "session": "SESSION: Don't Interrupt Me"
    },
    {
        "title": "Usability evaluation considered harmful (some of the time)",
        "authors": "Saul Greenberg, Bill Buxton",
        "abstract": "",
        "session": "SESSION: Invited Session: Usability Evaluation Considered H"
    },
    {
        "title": "Exploring the use of tangible user interfaces for human-robot interaction: a comparative study",
        "authors": "Cheng Guo, Ehud Sharlin",
        "abstract": "In this paper we suggest the use of tangible user interfaces (TUIs) for human-robot interaction (HRI) applications. We discuss the potential benefits of this approach while focusing on low-level of autonomy tasks. We present an experimental robotic interaction test bed to support our investigation. We use the test bed to explore two HRI-related task-sets: robotic navigation control and robotic posture control. We discuss the implementation of these two task-sets using an AIBO\" robot dog. Both tasks were mapped to two different robotic control interfaces: keypad interface which resembles the interaction approach currently common in HRI, and a gesture input mechanism based on Nintendo Wii\" game controllers. We discuss the interfaces implementation and conclude with a detailed user study for evaluating these different HRI techniques in the two robotic tasks-sets.",
        "session": "SESSION: Human-Robot Interaction"
    },
    {
        "title": "Precision timing in human-robot interaction: coordination of head movement and utterance",
        "authors": "Akiko Yamazaki, Keiichi Yamazaki, Yoshinori Kuno, Matthew Burdelski, Michie Kawashima, Hideaki Kuzuoka",
        "abstract": "As research over the last several decades has shown that non-verbal actions such as face and head movement play a crucial role in human interaction, such resources are also likely to play an important role in human-robot interaction. In developing a robotic system that employs embodied resources such as face and head movement, we cannot simply program the robot to move at random but rather we need to consider the ways these actions may be timed to specific points in the talk. This paper discusses our work in developing a museum guide robot that moves its head at interactionally significant points during its explanation of an exhibit. In order to proceed, we first examined the coordination of verbal and non-verbal actions in human guide-visitor interaction. Based on this analysis, we developed a robot that moves its head at interactionally significant points in its talk. We then conducted several experiments to examine human participant non-verbal responses to the robot's head and gaze turns. Our results show that participants are likely to display non-verbal actions, and do so with precision timing, when the robot turns its head and gaze at interactionally significant points than when the robot turns its head at not interactionally significant points. Based on these findings, we propose several suggestions for the design of a guide robot.",
        "session": "SESSION: Human-Robot Interaction"
    },
    {
        "title": "The see-Puck: a platform for exploring human-robot relationships",
        "authors": "Mattias Jacobsson, Johan Bodin, Lars Erik Holmquist",
        "abstract": "We present the see-Puck, a round display module that extends an open robot platform, the e-Puck. It holds 148 LEDs (light emitting diodes) to enable the presentation of eye-catching visual animated patterns, while keeping hardware costs and energy consumption at a minimum. The see-Puck was a result of a study of future robot applications, where relationship and interaction qualities found in owners of unusual pets (e.g. spiders, snakes, and lizards) were transferred to the robotic domain. In our first proof-of-concept application, humans and robots can engage in a playful open ended interaction. We argue that open interactive robot platforms such as the see-Puck point to opportunities not only in robotics but also future user interfaces and ubiquitous computing.",
        "session": "SESSION: Human-Robot Interaction"
    },
    {
        "title": "Explore! possibilities and challenges of mobile learning",
        "authors": "Maria F. Costabile, Antonella De Angeli, Rosa Lanzilotti, Carmelo Ardito, Paolo Buono, Thomas Pederson",
        "abstract": "This paper reports the experimental studies we have performed to evaluate Explore!, an m-learning system that supports middle school students during a visit to an archaeological park. It exploits a learning technique called excursion-game, whose aim is to help students to acquire historical notions while playing and to make archaeological visits more effective and exciting. In order to understand the potentials and limitations of Explore!, our studies compare the experience of playing the excursion-game with and without technological support. The design and evaluation of Explore! have provided knowledge on the advantages and pitfalls of m-learning that may be instrumental in informing the current debate on e-learning.",
        "session": "SESSION: Learning Support"
    },
    {
        "title": "Pause, predict, and ponder: use of narrative videos to improve cultural discussion and learning",
        "authors": "Amy Ogan, Vincent Aleven, Christopher Jones",
        "abstract": "Previous research shows that video viewing (a frequent activity in language courses) is more effective when students receive guidance. We investigate how to support students in an on-line environment in acquiring cultural knowledge and intercultural competence by viewing clips from feature films from the target culture. To test the effectiveness of a set of attention-focusing techniques (pause-predict-ponder), some of which have been shown to be effective in other contexts, we created ICCAT, a simple tutor that enhances an existing classroom model for the development of intercultural competence. We ran a study in two French Online classrooms with 35 participants, comparing ICCAT versions with and without attention-focusing techniques. We found that the addition of the pause-predict-ponder seemed to guide students in acquiring cultural knowledge and significantly increased students' ability to reason from an intercultural perspective. We discuss possible implications for intelligent tutoring systems in such difficult and ill-defined domains.",
        "session": "SESSION: Learning Support"
    },
    {
        "title": "WallCology: designing interaction affordances for learner engagement in authentic science inquiry",
        "authors": "Tom Moher, Brian Uphoff, Darshan Bhatt, Brenda López Silva, Peter Malcolm",
        "abstract": "The broadening array of technologies available to support the design of classroom activity has the potential to reshape science learning in schools. This paper presents a ubiquitous computing application, WallCology, which situates a virtual ecosystem within the unseen space of classroom walls, presenting affordances for science learners to engage in investigations of ecological phenomena. Motivated by a desire to foster authenticity in classroom science inquiry, WallCology extends the \"embedded phenomena\" framework in three ways: by enabling collaborative investigations among distributed work teams, by increasing the physicality of investigation activities, and by expanding the loci of activity sites. Pilot studies in two urban classrooms provide qualified support for the effectiveness of WallCology in promoting more authentic inquiry practices, content learning, and attitudes regarding scientific investigations.",
        "session": "SESSION: Learning Support"
    },
    {
        "title": "Measuring trust in wi-fi hotspots",
        "authors": "Tim Kindberg, Eamonn O'Neill, Chris Bevan, Vassilis Kostakos, Danaë Stanton Fraser, Tim Jay",
        "abstract": "Pervasive systems provide services that are situated within specific contexts. An everyday example of this is Wi-Fi hotspots. Factors such as branding and presentation are known to affect whether users are prepared to invest trust in services, but little is known about trust in situated services. This paper describes an experiment to measure de facto trust in Wi-Fi hotspots in public places, as opposed to examining trust behaviour in a simulated lab setting. We investigated two hypotheses about the effect of location-specific images in the hotspot's pages on trust behaviours, compared to images of non-specific locations. We found a significant result which confirms that decisions to access an unfamiliar Wi-Fi hotspot can be affected by location-relevant images.",
        "session": "SESSION: Trust and Security"
    },
    {
        "title": "Undercover: authentication usable in front of prying eyes",
        "authors": "Hirokazu Sasamoto, Nicolas Christin, Eiji Hayashi",
        "abstract": "A number of recent scams and security attacks (phishing, spyware, fake terminals, ...) hinge on a crook's ability to observe user behavior. In this paper, we describe the design, implementation, and evaluation of a novel class of user authentication systems that are resilient to observation attacks. Our proposal is the first to rely on the human ability to simultaneously process multiple sensory inputs to authenticate, and is resilient to most observation attacks. We build a prototype based on user feedback gained through low fidelity tests. We conduct a within-subjects usability study of the prototype with 38 participants, which we complement with a security analysis. Our results show that users can authenticate within times comparable to that of graphical password schemes, with relatively low error rates, while being considerably better protected against observation attacks. Our design and evaluation process allows us to outline design principles for observation-resilient authentication systems.",
        "session": "SESSION: Trust and Security"
    },
    {
        "title": "Access control by testing for shared knowledge",
        "authors": "Michael Toomim, Xianhang Zhang, James Fogarty, James A. Landay",
        "abstract": "Controlling the privacy of online content is difficult and often confusing. We present a social access control where users devise simple questions testing shared knowledge instead of constructing authenticated accounts and explicit access control rules. We implemented a prototype and conducted studies to explore the context of photo sharing security, gauge the difficulty of creating shared knowledge questions, measure their resilience to adversarial attack, and evaluate user ability to understand and predict this resilience.",
        "session": "SESSION: Trust and Security"
    },
    {
        "title": "Love and authentication",
        "authors": "Markus Jakobsson, Erik Stolterman, Susanne Wetzel, Liu Yang",
        "abstract": "Passwords are ubiquitous, and users and service providers alike rely on them for their security. However, good passwords may sometimes be hard to remember. For years, security practitioners have battled with the dilemma of how to authenticate people who have forgotten their passwords. Existing approaches suffer from high false positive and false negative rates, where the former is often due to low entropy or public availability of information, whereas the latter often is due to unclear or changing answers, or ambiguous or fault prone entry of the same. Good security questions should be based on long-lived personal preferences and knowledge, and avoid publicly available information. We show that many of the questions used by online matchmaking services are suitable as security questions. We first describe a new user interface approach suitable to such security questions that is offering a reduced risks of incorrect entry. We then detail the findings of experiments aimed at quantifying the security of our proposed method.",
        "session": "SESSION: Trust and Security"
    },
    {
        "title": "Reality-based interaction: a framework for post-WIMP interfaces",
        "authors": "Robert J.K. Jacob, Audrey Girouard, Leanne M. Hirshfield, Michael S. Horn, Orit Shaer, Erin Treacy Solovey, Jamie Zigelbaum",
        "abstract": "We are in the midst of an explosion of emerging human-computer interaction techniques that redefine our understanding of both computers and interaction. We propose the notion of Reality-Based Interaction (RBI) as a unifying concept that ties together a large subset of these emerging interaction styles. Based on this concept of RBI, we provide a framework that can be used to understand, compare, and relate current paths of recent HCI research as well as to analyze specific interaction designs. We believe that viewing interaction through the lens of RBI provides insights for design and uncovers gaps or opportunities for future research.",
        "session": "SESSION: Post-WIMP"
    },
    {
        "title": "Inflatable mouse: volume-adjustable mouse with air-pressure-sensitive input and haptic feedback",
        "authors": "Seoktae Kim, Hyunjung Kim, Boram Lee, Tek-Jin Nam, Woohun Lee",
        "abstract": "Inflatable Mouse is a volume-adjustable user interface. It can be inflated up to the volume of a familiar mouse, but be deflated and stored flat in a PC card slot of a laptop computer when not in use. Inflatable Mouse functions just like a typical mouse; moreover, it provides new interaction techniques by sensing the air pressure in the balloon of the mouse. It also addresses some issues associated with pressure-sensing interactions such as the lack of bi-directional input and the lack of effective feedback. Moreover, it can be used as both a control tool and a display tool. In this paper, the design of an Inflatable Mouse prototype is described and potential application scenarios such as zooming in/out and fast scrolling using pressure control are explained. We also discuss the potential use of Inflatable Mouse as an emotional communication tool.",
        "session": "SESSION: Post-WIMP"
    },
    {
        "title": "MightyTrace: multiuser tracking technology on lc-displays",
        "authors": "Ramon Hofer, Patrick Kaplan, Andreas Kunz",
        "abstract": "In this paper, we present a new technology to perform multi Tangible User Interface (TUI) tracking on standard LC-displays. A lot of existing technologies for tangible user interface tracking use back- or front-projection setups, but they suffer from poor image quality, shadow casting, non-ergonomic interaction, and/or large installations. Thus, we introduce a principle that allows using the InfrActables' technology on a large LC-display. It combines simultaneous multiuser input on a display with the advantages of a large flat screen. We use infrared photodiodes (IR-LEDs) mounted behind the display's LC-matrix to track infrared diodes in front of the screen. After initial tests concerning the infrared transparency and sensor characteristics, we developed a proof of concept consisting of 384 sensors, which are addressed through a modular master-slave circuit. Using several interaction devices, multiuser interaction is possible.",
        "session": "SESSION: Post-WIMP"
    },
    {
        "title": "Quickdraw: the impact of mobility and on-body placement on device access time",
        "authors": "Daniel L. Ashbrook, James R. Clawson, Kent Lyons, Thad E. Starner, Nirmal Patel",
        "abstract": "We investigate the effect of placement and user mobility on the time required to access an on-body interface. In our study, a wrist-mounted system was significantly faster to access than a device stored in the pocket or mounted on the hip. In the latter two conditions, 78% of the time it took to access the device was spent retrieving the device from its holder. As mobile devices are beginning to include peripherals (for example, Bluetooth headsets and watches connected to a mobile phone stored in the pocket), these results may help guide interface designers with respect to distributing functions across the body between peripherals.",
        "session": "SESSION: Post-WIMP"
    },
    {
        "title": "Using tags to assist near-synchronous communication",
        "authors": "Gary Hsieh, Jennifer Lai, Scott E. Hudson, Robert Kraut",
        "abstract": "In this work, we introduce the use of tags to support the near synchronous use of instant messaging. As a proof-of-concept, we developed a plug-in in Lotus Sametime, an enterprise IM client. Our plug-in supports tasks that do not need immediate attention and tasks that have deadlines. A trial deployment and survey shows that users can see the potential usefulness of such a tagging system in their IM communication. Furthermore, users rated our design intuitive and easy to use. Longer study is needed to explore communication norms that results from its use.",
        "session": "SESSION: Post-WIMP"
    },
    {
        "title": "Improving meeting capture by applying television production principles with audio and motion detection",
        "authors": "Abhishek Ranjan, Jeremy Birnholtz, Ravin Balakrishnan",
        "abstract": "",
        "session": "SESSION: Improved Video Navigation and Capture"
    },
    {
        "title": "Video browsing by direct manipulation",
        "authors": "Pierre Dragicevic, Gonzalo Ramos, Jacobo Bibliowitcz, Derek Nowrouzezahrai, Ravin Balakrishnan, Karan Singh",
        "abstract": "",
        "session": "SESSION: Improved Video Navigation and Capture"
    },
    {
        "title": "DRAGON: a direct manipulation interface for frame-accurate in-scene video navigation",
        "authors": "Thorsten Karrer, Malte Weiss, Eric Lee, Jan Borchers",
        "abstract": "",
        "session": "SESSION: Improved Video Navigation and Capture"
    },
    {
        "title": "Handsaw: tangible exploration of volumetric data by direct cut-plane projection",
        "authors": "Leonardo Bonanni, Jason Alonso, Neil Chao, Greg Vargas, Hiroshi Ishii",
        "abstract": "",
        "session": "SESSION: Improved Video Navigation and Capture"
    },
    {
        "title": "Do I live in a flood basin?: synthesizing ten thousand maps",
        "authors": "Miguel Elias, Jeremy Elson, Danyel Fisher, Jon Howell",
        "abstract": "The recent introduction of simple, web-based geographic visualization interfaces has unleashed a tidal wave of new geographic content now available on the Internet. There has been enormous attention on the development of data interchange standards and programming interfaces that make all this content interoperable, but far less thought about how the user experience should change when users have their choice of 10,000 maps. To inform the design of online mapping systems, we investigate the case of queries that require correlation of multiple maps---that is, discovery and synthesis of several map layers. We based our study on interviews with expert users of maps: archivists and librarians. This paper describes our user-task taxonomy distilled from these interviews, and presents MapSynthesizer, a prototype system that allows users to efficiently query, discover, and integrate many maps from a corpus of thousands.",
        "session": "SESSION: Visual Synthesis"
    },
    {
        "title": "Integrating statistics and visualization: case studies of gaining clarity during exploratory data analysis",
        "authors": "Adam Perer, Ben Shneiderman",
        "abstract": "Although both statistical methods and visualizations have been used by network analysts, exploratory data analysis remains a challenge. We propose that a tight integration of these technologies in an interactive exploratory tool could dramatically speed insight development. To test the power of this integrated approach, we created a novel social network analysis tool, SocialAction, and conducted four long-term case studies with domain experts, each working on unique data sets with unique problems. The structured replicated case studies show that the integrated approach in SocialAction led to significant discoveries by a political analyst, a bibliometrician, a healthcare consultant, and a counter-terrorism researcher. Our contributions demonstrate that the tight integration of statistics and visualizations improves exploratory data analysis, and that our evaluation methodology for long-term case studies captures the research strategies of data analysts.",
        "session": "SESSION: Visual Synthesis"
    },
    {
        "title": "Your place or mine?: visualization as a community component",
        "authors": "Catalina M. Danis, Fernanda B. Viegas, Martin Wattenberg, Jesse Kriss",
        "abstract": "Many Eyes is a web site that provides collaborative visualization services, allowing users to upload data sets, visualize them, and comment on each other's visualizations. This paper describes a first interview-based study of Many Eyes users, which sheds light on user motivation for creating public visualizations. Users talked about data for many reasons, from scientific research to political advocacy to hobbies. One consistent theme across these different scenarios is the use of visualizations in communication and collaborative practices. Collaboration and conversation, however, often took place outside the site, leaving no traces on Many Eyes itself. In other words, despite spurring significant social activity, Many Eyes is not so much an online community as a \"community component\" which users insert into pre-existing online social systems.",
        "session": "SESSION: Visual Synthesis"
    },
    {
        "title": "Escape: a target selection technique using visually-cued gestures",
        "authors": "Koji Yatani, Kurt Partridge, Marshall Bern, Mark W. Newman",
        "abstract": "Many mobile devices have touch-sensitive screens that people interact with using fingers or thumbs. However, such interaction is difficult because targets become occluded, and because fingers and thumbs have low input resolution. Recent research has addressed occlusion through visual techniques. However, the poor resolution of finger and thumb selection still limits selection speed. In this paper, we address the selection speed problem through a new target selection technique called Escape. In Escape, targets are selected by gestures cued by icon position and appearance. A user study shows that for targets six to twelve pixels wide, Escape performs at a similar error rate and at least 30% faster than Shift, an alternative technique, on a similar task. We evaluate Escape's performance in different circumstances, including different icon sizes, icon overlap, use of color, and gesture direction. We also describe an algorithm that assigns icons to targets, thereby improving Escape's performance.",
        "session": "SESSION: Touch and Target Selection"
    },
    {
        "title": "Rubbing and tapping for precise and rapid selection on touch-screen displays",
        "authors": "Alex Olwal, Steven Feiner, Susanna Heyman",
        "abstract": "We introduce two families of techniques, rubbing and tapping, that use zooming to make possible precise interaction on passive touch screens, and describe examples of each. Rub-Pointing uses a diagonal rubbing gesture to integrate pointing and zooming in a single-handed technique. In contrast, Zoom-Tapping is a two-handed technique in which the dominant hand points, while the non-dominant hand taps to zoom, simulating multi-touch functionality on a single-touch display. Rub-Tapping is a hybrid technique that integrates rubbing with the dominant hand to point and zoom, and tapping with the non-dominant hand to confirm selection. We describe the results of a formal user study comparing these techniques with each other and with the well-known Take-Off and Zoom-Pointing selection techniques. Rub-Pointing and Zoom-Tapping had significantly fewer errors than Take-Off for small targets, and were significantly faster than Take-Off and Zoom-Pointing. We show how the techniques can be used for fluid interaction in an image viewer and in Google Maps.",
        "session": "SESSION: Touch and Target Selection"
    },
    {
        "title": "Graffiti vs. unistrokes: an empirical comparison",
        "authors": "Steven J. Castellucci, I. Scott MacKenzie",
        "abstract": "Unistrokes and Graffiti are stylus-based text entry techniques. While Unistrokes is recognized in academia, Graffiti is commercially prevalent in PDAs. Though numerous studies have investigated the usability of Graffiti, none exists to compare its long-term performance with that of Unistrokes. This paper presents a longitudinal study comparing entry speed, correction rate, stroke duration, and preparation (i.e., inter-stroke) time of these two techniques. Over twenty fifteen-phrase sessions, performance increased from 4.0 wpm to 11.4 wpm for Graffiti and from 4.1 wpm to 15.8 wpm for Unistrokes. Correction rates were high for both techniques. However, rates for Graffiti remained relatively consistent at 26%, while those for Unistrokes decreased from 43% to 16%.",
        "session": "SESSION: Touch and Target Selection"
    },
    {
        "title": "The cone and the lazy bubble: two efficient alternatives between the point cursor and the bubble cursor",
        "authors": "Joona Laukkanen, Poika Isokoski, Kari-Jouko Räihä",
        "abstract": "We evaluated two cursor designs in the continuum between the traditional point cursor and the bubble cursor by Grossman and Balakrishnan. The lazy bubble cursor expanded to envelop the closest target when the ratio of the distances to the closest and the second closest target was less than 1:2. In addition to this lazy behavior the cone cursor had a tail that stayed on the last enveloped target until the next target was enveloped. In an experiment with 18 participants we found that the bubble cursor was faster than our cursors that had smaller target activation areas but the difference remained very small. Of the bubble cursor variants the lazy bubble exhibited higher error rate than the other two. Thus, the winners on the objective metrics were the bubble cursor and the cone cursor. The lazy bubble cursor and the bubble cursor were preferred in subjective ratings.",
        "session": "SESSION: Touch and Target Selection"
    },
    {
        "title": "A bright green perspective on sustainable choices",
        "authors": "Allison Woodruff, Jay Hasbrouck, Sally Augustin",
        "abstract": "We present a qualitative study of 35 United States households whose occupants have made significant accommodations to their homes and behaviors in order to be more environmentally responsible. Our goal is to inform the design of future sustainable technologies through an exploration of existing \"green\" lifestyles. We describe the motivations, practices, and experiences of the participants. The participants had diverse motivations ranging from caring for the Earth to frugal minimalism, and most participants also evidenced a desire to be unique. Most participants actively and consciously managed their homes and their daily practices to optimize their environmental responsibility. Their efforts to be environmentally responsible typically required significant dedication of time, attention, and other resources. As this level of commitment and desire to be unique may not generalize readily to the broader population, we discuss the importance of interactive technologies that influence surrounding infrastructure and circumstances in order to facilitate environmental responsibility.",
        "session": "SESSION: Green Day"
    },
    {
        "title": "Breaking the disposable technology paradigm: opportunities for sustainable interaction design for mobile phones",
        "authors": "Elaine M. Huang, Khai N. Truong",
        "abstract": "We present a qualitative study of mobile phone ownership, replacement and disposal practices geared towards identifying design opportunities towards sustainable mobile phone interfaces. Our work investigates how people understand the lifespan of their phones, what factors, such as style, service contracts, and functionality, affect how they attribute value to their phones, and their awareness and actions regarding mobile phone sustainability. Our findings reveal the complexity of the actions and decision-making processes involved in phone ownership and replacement. We use these findings to present open areas for sustainable interaction design and generate seed ideas for designs and services to provoke thought and further exploration towards more sustainable mobile phone interfaces and practices.",
        "session": "SESSION: Green Day"
    },
    {
        "title": "Sustainable millennials: attitudes towards sustainability and the material effects of interactive technologies",
        "authors": "Kristin Hanks, William Odom, David Roedl, Eli Blevis",
        "abstract": "This paper describes the design and interprets the results of a survey of 435 undergraduate students concerning the attitudes of this mainly millennial population towards sustainability apropos of the material effects of information technologies. This survey follows from earlier work on notions of Sustainable Interaction Design (SID)---that is the perspective that sustainability can and should be a central focus within HCI. In so doing it advances to some degree the empirical resources needed to scaffold an understanding of the theory and principles of SID. The interpretations offered yield key insights about understanding different notions of what it means to be successful in a material sense to this population and specific design principles for creating interactive designs differently such that more sustainable behaviors are palatable to individuals of varying attitudes.",
        "session": "SESSION: Green Day"
    },
    {
        "title": "Children attribute moral standing to a personified agent",
        "authors": "Nathan G. Freier",
        "abstract": "This paper describes the results of a study conducted to answer two questions: (1) Do children generalize their understanding of distinctions between conventional and moral violations in human-human interactions to human-agent interactions? and (2) Does the agent's ability to make claims to its own moral standing influence children's judgments? A two condition, between- and within-subjects study was conducted in which 60 eight and nine year-old children interacted with a personified agent and observed a researcher interacting with the same agent. A semi-structured interview was conducted to investigate the children's judgments and reasoning about the observed interactions as well as hypothetical human-human interactions. Results suggest that children do distinguish between conventional and moral violations in human-agent interactions and that the ability of the agent to express harm and make claims to its own rights significantly increases children's likelihood of identifying an act against the agent as a moral violation.",
        "session": "SESSION: Kid's Stuff"
    },
    {
        "title": "Mischief: supporting remote teaching in developing regions",
        "authors": "Neema Moraveji, Taemie Kim, James Ge, Udai Singh Pawar, Kathleen Mulcahy, Kori Inkpen",
        "abstract": "Mischief is a system to support traditional classroom practices between a remote instructor and a group of collocated students. Meant for developing regions, each student in the classroom is given a mouse and these are connected to a single machine and shared display. We present observations of teaching practices in rural Chinese classrooms that led to Mischief's design. Mischief's user interface, with which scores of collocated students can interact simultaneously, supports anonymous responses, communicates focus of attention, and maintains the role of the instructor. Mischief is an extensible platform in which Microsoft PowerPoint slides, used commonly in developing regions, are made interactive. We setup a controlled environment where Mischief was used by classrooms of children with a remote math instructor. The results from the study provided insight into the usability and capacity of the system to support traditional classroom interactions. These observations were also the impetus for a redesign of several components of Mischief and are also presented. These findings contribute both a novel system for synchronous distance education in an affordable manner and design insights for creators of related systems.",
        "session": "SESSION: Kid's Stuff"
    },
    {
        "title": "Playful toothbrush: ubicomp technology for teaching tooth brushing to kindergarten children",
        "authors": "Yu-Chen Chang, Jin-Ling Lo, Chao-Ju Huang, Nan-Yi Hsu, Hao-Hua Chu, Hsin-Yen Wang, Pei-Yu Chi, Ya-Lin Hsieh",
        "abstract": "This case study in UbiComp technology and design presents a \"Playful Toothbrush\" system for assisting parents and teachers to motivate kindergarten children to learn proper and thorough brushing skills. The system includes a vision-based motion tracker that recognizes different tooth brushing strokes and a tooth brushing game in which the child cleans a virtual, mirror picture of his/her dirty teeth by physically brushing his/her own teeth. The user study results suggest that Playful Toothbrush enhances the effectiveness of kindergarten children in brushing their teeth, as measured by number of brushing strokes, duration of brushing and thoroughness of teeth cleaning.",
        "session": "SESSION: Kid's Stuff"
    },
    {
        "title": "Collaborative editing for improved usefulness and usability of transcript-enhanced webcasts",
        "authors": "Cosmin Munteanu, Ron Baecker, Gerald Penn",
        "abstract": "One challenge in facilitating skimming or browsing through archives of on-line recordings of webcast lectures is the lack of text transcripts of the recorded lecture. Ideally, transcripts would be obtainable through Automatic Speech Recognition (ASR). However, current ASR systems can only deliver, in realistic lecture conditions, a Word Error Rate of around 45% -- above the accepted threshold of 25%. In this paper, we present the iterative design of a webcast extension that engages users to collaborate in a wiki-like manner on editing the ASR-produced imperfect transcripts, and show that this is a feasible solution for improving the quality of lecture transcripts. We also present the findings of a field study carried out in a real lecture environment investigating how students use and edit the transcripts.",
        "session": "SESSION: Collaborative User Interfaces"
    },
    {
        "title": "Collaborative interaction with volumetric displays",
        "authors": "Tovi Grossman, Ravin Balakrishnan",
        "abstract": "Volumetric displays possess a number of unique properties which potentially make them particularly suitable for collaborative 3D applications. Because such displays have only recently become available, interaction techniques for collaborative usage have yet to be explored. In this paper, we initiate this exploration. We present a prototype collaborative 3D model viewing application, which served as a platform for our explorations. We outline three design goals, discuss the key interaction issues which were encountered, and describe a suite of new techniques in detail. In initial user observation sessions, we found that our techniques allowed users to successfully complete a variety of 3D tasks. Furthermore, interviews with experts in potential usage domains indicated that the techniques we developed can serve as a baseline for future collaborative applications for volumetric displays.",
        "session": "SESSION: Collaborative User Interfaces"
    },
    {
        "title": "Multimodal collaborative handwriting training for visually-impaired people",
        "authors": "Beryl Plimmer, Andrew Crossan, Stephen A. Brewster, Rachel Blagojevic",
        "abstract": "\"McSig\" is a multimodal teaching and learning environ-ment for visually-impaired students to learn character shapes, handwriting and signatures collaboratively with their teachers. It combines haptic and audio output to realize the teacher's pen input in parallel non-visual modalities. McSig is intended for teaching visually-impaired children how to handwrite characters (and from that signatures), something that is very difficult without visual feedback. We conducted an evaluation with eight visually-impaired children with a pretest to assess their current skills with a set of character shapes, a training phase using McSig and then a post-test of the same character shapes to see if there were any improvements. The children could all use McSig and we saw significant improvements in the character shapes drawn, particularly by the completely blind children (many of whom could draw almost none of the characters before the test). In particular, the blind participants all expressed enjoyment and excitement about the system and using a computer to learn to handwrite.",
        "session": "SESSION: Collaborative User Interfaces"
    },
    {
        "title": "ArtLinks: fostering social awareness and reflection in museums",
        "authors": "Dan Cosley, Joel Lewenstein, Andrew Herman, Jenna Holloway, Jonathan Baxter, Saeko Nomura, Kirsten Boehner, Geri Gay",
        "abstract": "Technologies in museums often support learning goals, providing information about exhibits. However, museum visitors also desire meaningful experiences and enjoy the social aspects of museum-going, values ignored by most museum technologies. We present ArtLinks, a visualization with three goals: helping visitors make connections to exhibits and other visitors by highlighting those visitors who share their thoughts; encouraging visitors' reflection on the social and liminal aspects of museum-going and their expectations of technology in museums; and doing this with transparency, aligning aesthetically pleasing elements of the design with the goals of connection and reflection. Deploying ArtLinks revealed that people have strong expectations of technology as an information appliance. Despite these expectations, people valued connections to other people, both for their own sake and as a way to support meaningful experience. We also found several of our design choices in the name of transparency led to unforeseen tradeoffs between the social and the liminal.",
        "session": "SESSION: Aesthetics, Awareness, and Sketching"
    },
    {
        "title": "K-sketch: a 'kinetic' sketch pad for novice animators",
        "authors": "Richard C. Davis, Brien Colwell, James A. Landay",
        "abstract": "Because most animation tools are complex and time-consuming to learn and use, most animations today are created by experts. To help novices create a wide range of animations quickly, we have developed a general-purpose, informal, 2D animation sketching system called K-Sketch. Field studies investigating the needs of animators and would-be animators helped us collect a library of usage scenarios for our tool. A novel optimization technique enabled us to design an interface that is simultaneously fast, simple, and powerful. The result is a pen-based system that relies on users' intuitive sense of space and time while still supporting a wide range of uses. In a laboratory experiment that compared K-Sketch to a more formal animation tool (PowerPoint), participants worked three times faster, needed half the learning time, and had significantly lower cognitive load with K-Sketch.",
        "session": "SESSION: Aesthetics, Awareness, and Sketching"
    },
    {
        "title": "The LilyPad Arduino: using computational textiles to investigate engagement, aesthetics, and diversity in computer science education",
        "authors": "Leah Buechley, Mike Eisenberg, Jaime Catchen, Ali Crockett",
        "abstract": "The advent of novel materials (such as conductive fibers) combined with accessible embedded computing platforms have made it possible to re-imagine the landscapes of fabric and electronic crafts--extending these landscapes with the creative range of electronic/computational textiles or e-textiles. This paper describes the LilyPad Arduino, a fabric-based construction kit that enables novices to design and build their own soft wearables and other textile artifacts. The kit consists of a microcontroller and an assortment of sensors and actuators in stitch-able packages; these elements can be sewn to cloth substrates and each other with conductive thread to build e-textiles. This paper will introduce the latest version of the kit; reflect on its affordances; present the results of our most recent user studies; and discuss possible directions for future work in the area of personalized e-textile design and its relation to technology education.",
        "session": "SESSION: Aesthetics, Awareness, and Sketching"
    },
    {
        "title": "A diary study of mobile information needs",
        "authors": "Timothy Sohn, Kevin A. Li, William G. Griswold, James D. Hollan",
        "abstract": "Being mobile influences not only the types of information people seek but also the ways they attempt to access it. Mobile contexts present challenges of changing location and social context, restricted time for information access, and the need to share attentional resources among concurrent activities. Understanding mobile information needs and associated interaction challenges is fundamental to improving designs for mobile phones and related devices. We conducted a two-week diary study to better understand mobile information needs and how they are addressed. Our study revealed that depending on the time and resources available, as well as the situational context, people use diverse and, at times, ingenious ways to obtain needed information. We summarize key findings and discuss design implications for mobile technology.",
        "session": "SESSION: Data Collection"
    },
    {
        "title": "Tracking real-time user experience (TRUE): a comprehensive instrumentation solution for complex systems",
        "authors": "Jun H. Kim, Daniel V. Gunn, Eric Schuh, Bruce Phillips, Randy J. Pagulayan, Dennis Wixon",
        "abstract": "Automatic recording of user behavior within a system (instrumentation) to develop and test theories has a rich history in psychology and system design. Often, researchers analyze instrumented behavior in isolation from other data. The problem with collecting instrumented behaviors without attitudinal, demographic, and contextual data is that researchers have no way to answer the 'why' behind the 'what'. We have combined the collection and analysis of behavioral instrumentation with other HCI methods to develop a system for Tracking Real-Time User Experience (TRUE). Using two case studies as examples, we demonstrate how we have evolved instrumentation methodology and analysis to extensively improve the design of video games. It is our hope that TRUE is adopted and adapted by the broader HCI community, becoming a useful tool for gaining deep insights into user behavior and improvement of design for other complex systems.",
        "session": "SESSION: Data Collection"
    },
    {
        "title": "Crowdsourcing user studies with Mechanical Turk",
        "authors": "Aniket Kittur, Ed H. Chi, Bongwon Suh",
        "abstract": "User studies are important for many aspects of the design process and involve techniques ranging from informal surveys to rigorous laboratory studies. However, the costs involved in engaging users often requires practitioners to trade off between sample size, time requirements, and monetary costs. Micro-task markets, such as Amazon's Mechanical Turk, offer a potential paradigm for engaging a large number of users for low time and monetary costs. Here we investigate the utility of a micro-task market for collecting user measurements, and discuss design considerations for developing remote micro user evaluation tasks. Although micro-task markets have great potential for rapidly collecting user measurements at low costs, we found that special care is needed in formulating tasks in order to harness the capabilities of the approach.",
        "session": "SESSION: Data Collection"
    },
    {
        "title": "Aligning temporal data by sentinel events: discovering patterns in electronic health records",
        "authors": "Taowei David Wang, Catherine Plaisant, Alexander J. Quinn, Roman Stanchak, Shawn Murphy, Ben Shneiderman",
        "abstract": "Electronic Health Records (EHRs) and other temporal databases contain hidden patterns that reveal important cause-and-effect phenomena. Finding these patterns is a challenge when using traditional query languages and tabular displays. We present an interactive visual tool that complements query formulation by providing operations to align, rank and filter the results, and to visualize estimates of the intervals of validity of the data. Display of patient histories aligned on sentinel events (such as a first heart attack) enables users to spot precursor, co-occurring, and aftereffect events. A controlled study demonstrates the benefits of providing alignment (with a 61% speed improvement for complex tasks). A qualitative study and interviews with medical professionals demonstrates that the interface can be learned quickly and seems to address their needs.",
        "session": "SESSION: Health and Wellness"
    },
    {
        "title": "Celebratory technology: new directions for food research in HCI",
        "authors": "Andrea Grimes, Richard Harper",
        "abstract": "Food is a central part of our lives. Fundamentally, we need food to survive. Socially, food is something that brings people together-individuals interact through and around it. Culturally, food practices reflect our ethnicities and nationalities. Given the importance of food in our daily lives, it is important to understand what role technology currently plays and the roles it can be imagined to play in the future. In this paper we describe the existing and potential design space for HCI in the area of human-food interaction. We present ideas for future work on designing technologies in the area of human-food interaction that celebrate the positive interactions that people have with food as they eat and prepare foods in their everyday lives.",
        "session": "SESSION: Health and Wellness"
    },
    {
        "title": "MAHI: investigation of social scaffolding for reflective thinking in diabetes management",
        "authors": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, Daniel Greenblatt",
        "abstract": "In the recent years, the number of individuals engaged in self-care of chronic diseases has grown exponentially. Advances in computing technologies help individuals with chronic diseases collect unprecedented volumes of health-related data. However, engaging in reflective analysis of the collected data may be challenging for the untrained individuals. We present MAHI, a health monitoring application that assists newly diagnosed individuals with diabetes in acquiring and developing reflective thinking skills through social interaction with diabetes educators. The deployment study with twenty five newly diagnosed individuals with diabetes demonstrated that MAHI significantly contributed to individuals' achievement of their diabetes management goals (changing diet). More importantly, MAHI inspired individuals to adopt Internal Locus of Control, which often leads to persistent engagement in self-care and positive health outcomes.",
        "session": "SESSION: Health and Wellness"
    },
    {
        "title": "Accountabilities of presence: reframing location-based systems",
        "authors": "Emily Troshynski, Charlotte Lee, Paul Dourish",
        "abstract": "How do mobility and presence feature as aspects of social life? Using a case study of paroled offenders tracked via Global Positioning System (GPS), we explore the ways that location-based technologies frame people's everyday experiences of space. In particular, we focus on how access and presence are negotiated outside of traditional conceptions of \"privacy.\" We introduce the notion of accountabilities of presence and suggest that it is a more useful concept than \"privacy\" for understanding the relationship between presence and sociality.",
        "session": "SESSION: I am here. Where are you?"
    },
    {
        "title": "From awareness to repartee: sharing location within social groups",
        "authors": "Louise Barkhuus, Barry Brown, Marek Bell, Scott Sherwood, Malcolm Hall, Matthew Chalmers",
        "abstract": "This paper investigates emergent practices around 'microblogging', changing and sharing status within a social group. We present results from a trial of 'Connecto', a phone based status and location sharing application that allows a group to 'tag' areas and have individuals' locations shared automatically on a mobile phone. In use the system moved beyond being an awareness tool to a way of continuing the ongoing 'story' of conversations within the group. Through sharing status and location the system supported each groups' ongoing repartee - a site for social exchange, enjoyment and friendship.",
        "session": "SESSION: I am here. Where are you?"
    },
    {
        "title": "Lean and zoom: proximity-aware user interface and content magnification",
        "authors": "Chris Harrison, Anind K. Dey",
        "abstract": "The size and resolution of computer displays has increased dramatically, allowing more information than ever to be rendered on-screen. However, items can now be so small or screens so cluttered that users need to lean forward to properly examine them. This behavior may be detrimental to a user's posture and eyesight. Our Lean and Zoom system detects a user's proximity to the display using a camera and magnifies the on-screen content proportionally. This alleviates dramatic leaning and makes items more readable. Results from a user study indicate people find the technique natural and intuitive. Most participants found on-screen content easier to read, and believed the technique would improve both their performance and comfort.",
        "session": "SESSION: I am here. Where are you?"
    },
    {
        "title": "Stirring up experience through movement in game play: effects on engagement and social behaviour",
        "authors": "Siân E. Lindley, James Le Couteur, Nadia L. Berthouze",
        "abstract": "The recent development of controllers designed around natural body movements has altered the nature of gaming and contributed towards it being marketed as a more social activity. The study reported here compares the use of Donkey Konga bongos with a standard controller to examine how affording motion through an input device affects social interaction. Levels of engagement with the game were also measured to explore whether increases in social behaviour in the 'real world' would result in reduced involvement with the 'game world'. Social interaction was significantly higher when the bongos were used, but this did not detract from engagement. Instead, engagement was also found to increase when body movement was afforded.",
        "session": "SESSION: I am here. Where are you?"
    },
    {
        "title": "Demonstrating the feasibility of using forearm electromyography for muscle-computer interfaces",
        "authors": "T Scott Saponas, Desney S. Tan, Dan Morris, Ravin Balakrishnan",
        "abstract": "We explore the feasibility of muscle-computer interfaces (muCIs): an interaction methodology that directly senses and decodes human muscular activity rather than relying on physical device actuation or user actions that are externally visible or audible. As a first step towards realizing the mu-CI concept, we conducted an experiment to explore the potential of exploiting muscular sensing and processing technologies for muCIs. We present results demonstrating accurate gesture classification with an off-the-shelf electromyography (EMG) device. Specifically, using 10 sensors worn in a narrow band around the upper forearm, we were able to differentiate position and pressure of finger presses, as well as classify tapping and lifting gestures across all five fingers. We conclude with discussion of the implications of our results for future muCI designs.",
        "session": "SESSION: Physiological Sensing for Input"
    },
    {
        "title": "Improving eye cursor's stability for eye pointing tasks",
        "authors": "Xinyong Zhang, Xiangshi Ren, Hongbin Zha",
        "abstract": "In order to improve the stability of eye cursor, we introduce three methods, force field (FF), speed reduction (SR), and warping to target center (TC) to modulate eye cursor trajectories by counteracting eye jitter, which is the main cause of destabilizing the eye cursor. We evaluate these methods using two controlled experiments. One is an attention task experiment, which indicates that both FF and SR significantly alleviate the instability of eye cursor, but TC is not as we anticipated. The other is a 2D pointing task experiment, which shows that FF and SR as well as the improved implementation of SR (iSR) indeed improve human performance in dominant dwell-based eye pointing tasks of eye-based interactions. The method iSR is especially effective to accelerate eye pointing (10.5% and 8.5%) and reduce error rate (6.1% and 2.7%) when target diameter D = 45 and 60 pixels.",
        "session": "SESSION: Physiological Sensing for Input"
    },
    {
        "title": "Detecting the direction of listening with the emg signals measured behind ears",
        "authors": "Naoto Kaneko",
        "abstract": "In this paper, we describe the design of the ear tracker. The ear tracker detects the direction to which a person is listening. We propose the technique as a new form of an input device technology, which potentially allows the user to control machines with vague intention rather than explicit commands. Our ear tracker makes the detection with the electromyogram (EMG) signals probed behind ears. We have prototyped its hardware and algorithm. In our experiment, it shows 70% accuracy for detecting whether the testee is listening to the left or right.",
        "session": "SESSION: Physiological Sensing for Input"
    },
    {
        "title": "Predicting postcompletion errors using eye movements",
        "authors": "Raj M. Ratwani, J. Malcolm McCurry, J. Gregory Trafton",
        "abstract": "A postcompletion error is a distinct type of procedural error where one fails to complete the final step of a task. While redesigning interfaces and providing explicit cues have been shown to be effective in reducing the postcompletion error rate, these methods are not always feasible or well liked. This paper demonstrates how specific eye movement measures can be used to predict when a user will make a postcompletion error. We describe a real-time eye gaze system that provides cues to the user if and only if there is a high probability of the user making a postcompletion error.",
        "session": "SESSION: Physiological Sensing for Input"
    },
    {
        "title": "A user study of policy creation in a flexible access-control system",
        "authors": "Lujo Bauer, Lorrie Faith Cranor, Robert W. Reeder, Michael K. Reiter, Kami Vaniea",
        "abstract": "Significant effort has been invested in developing expressive and flexible access-control languages and systems. However, little has been done to evaluate these systems in practical situations with real users, and few attempts have been made to discover and analyze the access-control policies that users actually want to implement. We report on a user study in which we derive the ideal access policies desired by a group of users for physical security in an office environment. We compare these ideal policies to the policies the users actually implemented with keys and with a smartphone-based distributed access-control system. We develop a methodology that allows us to show quantitatively that the smartphone system allowed our users to implement their ideal policies more accurately and securely than they could with keys, and we describe where each system fell short.",
        "session": "SESSION: Policy, Telemedicine, and Enterprise"
    },
    {
        "title": "Competence articulation: alignment of competences and responsibilities in synchronous telemedical collaboration",
        "authors": "Simon B. Larsen, Jakob E. Bardram",
        "abstract": "Many studies and concepts within CSCW deal with the temporal, spatial, social, and computational aspects of supporting collaborative work. In this paper we want to pay attention to another central aspect to the achievement of collaborative work, namely the competence of the people involved. In particular, we want to look at the dynamic quality of competences, and investigate how competence is mutually developed in coordinated work. We have termed this process competence articulation, a concept which tries to emphasize competence as well as social development of competence as part of cooperation. The concept has emerged out of a longitudinal participatory design process investigating telemedical treatment of diabetic foot ulcers using video phones. We analyze the transitions occurring with the introduction of synchronous telemedical consultations and detail how the online video facilitates communication options for competence articulation, which again improve collaboration and thus the quality of the treatment.",
        "session": "SESSION: Policy, Telemedicine, and Enterprise"
    },
    {
        "title": "Results from deploying a participation incentive mechanism within the enterprise",
        "authors": "Rosta Farzan, Joan M. DiMicco, David R. Millen, Casey Dugan, Werner Geyer, Elizabeth A. Brownholtz",
        "abstract": "Success and sustainability of social networking sites is highly dependent on user participation. To encourage contribution to an opt-in social networking site designed for employees, we have designed and implemented a feature that rewards contribution with points. In our evaluation of the impact of the system, we found that employees are initially motivated to add more content to the site. This paper presents the analysis and design of the point system, the results of our experiment, and our insights regarding future directions derived from our post-experiment user interviews.",
        "session": "SESSION: Policy, Telemedicine, and Enterprise"
    },
    {
        "title": "Automatic whiteout++: correcting mini-QWERTY typing errors using keypress timing",
        "authors": "James Clawson, Kent Lyons, Alex Rudnick, Robert A. Iannucci, Jr., Thad Starner",
        "abstract": "By analyzing features of users' typing, Automatic Whiteout++ detects and corrects up to 32.37% of the errors made by typists while using a mini-QWERTY (RIM Blackberry style) keyboard. The system targets \"off-by-one\" errors where the user accidentally presses a key adjacent to the one intended. Using a database of typing from longitudinal tests on two different keyboards in a variety of contexts, we show that the system generalizes well across users, model of keyboard, user expertise, and keyboard visibility conditions. Since a goal of Automatic Whiteout++ is to embed it in the firmware of mini-QWERTY keyboards, it does not rely on a dictionary. This feature enables the system to correct errors mid-word instead of applying a correction after the word has been typed. Though we do not use a dictionary, we do examine the effect of varying levels of language context in the system's ability to detect and correct erroneous keypresses.",
        "session": "SESSION: Post-QWERTY QWERTY"
    },
    {
        "title": "EdgeWrite with integrated corner sequence help",
        "authors": "Benoît Martin, Poika Isokoski",
        "abstract": "We describe a system that informs the users of the shape of the EdgeWrite characters within the visual feedback area of EdgeWrite. We compared two versions (static and dynamic) of this design to a printed character chart in a five-session text entry experiment with three 8-participant groups. The participants were able to use EdgeWrite with the integrated help systems. There were no statistically significant differences in text entry rate between the group using the character chart and the two groups using the integrated help. However, the group with the dynamic help was faster than the group with the static help while maintaining a low corrected error rate.",
        "session": "SESSION: Post-QWERTY QWERTY"
    },
    {
        "title": "Interlaced QWERTY: accommodating ease of visual search and input flexibility in shape writing",
        "authors": "Shumin Zhai, Per Ola Kristensson",
        "abstract": "Shape writing is an input technology for touch-screen mobile phones and pen-tablets. To shape write text, the user spells out word patterns by sliding a finger or stylus over a graphical keyboard. The user's trace is then recognized by a pattern recognizer. In this paper we analyze and evaluate various keyboard layouts, including alphabetic, optimized (ATOMIK), QWERTY, and interlaced QWERTY for shape writing. The goodness of a layout for shape writing has two aspects. For users' initial ease of use the letters should be easy to visually locate. For long term use, however, the layout should maximize the imprecision tolerance and writing flexibility for all words. We present empirical studies for the former and mathematical analyses for the latter. Our results led to a new layout, interlaced QWERTY, which offers excellent separation of word shapes, while still maintaining a low visual search time. Many of the findings in our study also apply to traditional soft keyboards tapped with a stylus or one finger.",
        "session": "SESSION: Post-QWERTY QWERTY"
    },
    {
        "title": "Design, adoption, and assessment of a socio-technical environment supporting independence for persons with cognitive disabilities",
        "authors": "Stefan Parry Carmien, Gerhard Fischer",
        "abstract": "A significant fraction of persons with cognitive disabilities are potentially able to live more independently with the use of powerful tools embedded in their social environment. The Memory Aiding Prompting System (MAPS) provides an environment in which caregivers can create scripts that can be used by people with cognitive disabilities (\"clients\") to support them in carrying out tasks that they would not be able to achieve by themselves. To account for the great diversity among clients, MAPS was developed as a meta-design environment, empowering the caregivers to develop personalized prompting systems for the specific needs of individual clients.",
        "session": "SESSION: Beyond End-User Programming"
    },
    {
        "title": "Ingimp: introducing instrumentation to an end-user open source application",
        "authors": "Michael Terry, Matthew Kay, Brad Van Vugt, Brandon Slack, Terry Park",
        "abstract": "Open source projects are gradually incorporating usability methods into their development practices, but there are still many unmet needs. One particular need for nearly any open source project is data that describes its user base, including information indicating how the software is actually used in practice. This paper presents the concept of open instrumentation, or the augmentation of an open source application to openly collect and publicly disseminate rich application usage data. We demonstrate the concept of open instrumentation in ingimp, a version of the open source GNU Image Manipulation Program that has been modified to collect end-user usage data. ingimp automatically collects five types of data: The commands used, high-level user interface events, overall features of the user's documents, summaries of the user's general computing environment, and users' own descriptions of their planned tasks. In the spirit of open source software, all collected data are made available for anyone to download and analyze. This paper's primary contributions lie in presenting the overall design of ingimp, with a particular focus on how the design addresses two prominent issues in open instrumentation: privacy and motivating use.",
        "session": "SESSION: Beyond End-User Programming"
    },
    {
        "title": "Testing vs. code inspection vs. what else?: male and female end users' debugging strategies",
        "authors": "Neeraja Subrahmaniyan, Laura Beckwith, Valentina Grigoreanu, Margaret Burnett, Susan Wiedenbeck, Vaishnavi Narayanan, Karin Bucht, Russell Drummond, Xiaoli Fern",
        "abstract": "Little is known about the strategies end-user programmers use in debugging their programs, and even less is known about gender differences that may exist in these strategies. Without this type of information, designers of end-user programming systems cannot know the \"target\" at which to aim, if they are to support male and female end-user programmers. We present a study investigating this issue. We asked end-user programmers to debug spreadsheets and to describe their debugging strategies. Using mixed methods, we analyzed their strategies and looked for relationships among participants' strategy choices, gender, and debugging success. Our results indicate that males and females debug in quite different ways, that opportunities for improving support for end-user debugging strategies for both genders are abundant, and that tools currently available to end-user debuggers may be especially deficient in supporting debugging strategies used by females.",
        "session": "SESSION: Beyond End-User Programming"
    },
    {
        "title": "Designs on dignity: perceptions of technology among the homeless",
        "authors": "Christopher A. Le Dantec, W. Keith Edwards",
        "abstract": "Technology, it is argued, has the potential to improve everyone's life: from the workplace, to entertainment, to easing chores around the home. But what of people who have neither job nor home? We undertook a qualitative study of the homeless population in a metropolitan U.S. city to better understand what it means to be homeless and how technology--from cell phones to bus passes--affects their daily lives. The themes we identify provide an array of opportunities for technological interventions that can empower the homeless population. Our investigation also reveals the need to reexamine some of the assumptions made in HCI about the relationship people have with technology. We suggest a broader awareness of the social context of technology use as a critical component when considering design innovation for the homeless.",
        "session": "SESSION: Dignity in Design"
    },
    {
        "title": "Empathy and experience in HCI",
        "authors": "Peter Wright, John McCarthy",
        "abstract": "For a decade HCI researchers and practitioners have been developing methods, practices and designs 'for the full range of human experience'. On the one hand, a variety of approaches to design, such as aesthetic, affective, and ludic that emphasize particular qualities and contexts of experience and particular approaches to intervening in interactive experience have become focal. On the other, a variety of approaches to understanding users and user experience, based on narrative, biography, and role-play have been developed and deployed. These developments can be viewed in terms of one of the seminal commitments of HCI, 'to know the user'. Empathy has been used as a defining characteristic of designer-user relationships when design is concerned with user experience. In this article, we use 'empathy' to help position some emerging design and user-experience methodologies in terms of dynamically shifting relationships between designers, users, and artefacts.",
        "session": "SESSION: Dignity in Design"
    },
    {
        "title": "Interactional empowerment",
        "authors": "Kristina Höök, Anna Ståhl, Petra Sundström, Jarmo Laaksolaahti",
        "abstract": "We propose that an interactional perspective on how emotion is constructed, shared and experienced, may be a good basis for designing affective interactional systems that do not infringe on privacy or autonomy, but instead empowers users. An interactional design perspective may make use of design elements such as open-ended, ambiguous, yet familiar, interaction surfaces that users can use as a basis to make sense of their own emotions and their communication with one-another. We describe the interactional view on design for emotional communication, and provide a set of orienting design concepts and methods for design and evaluation that help translate the interactional view into viable applications. From an embodied interaction theory perspective, we argue for a non-dualistic, non-reductionist view on affective interaction design.",
        "session": "SESSION: Dignity in Design"
    },
    {
        "title": "Experience sampling for building predictive user models: a comparative study",
        "authors": "Ashish Kapoor, Eric Horvitz",
        "abstract": "Experience sampling has been employed for decades to collect assessments of subjects' intentions, needs, and affective states. In recent years, investigators have employed automated experience sampling to collect data to build predictive user models. To date, most procedures have relied on random sampling or simple heuristics. We perform a comparative analysis of several automated strategies for guiding experience sampling, spanning a spectrum of sophistication, from a random sampling procedure to increasingly sophisticated active learning. The more sophisticated methods take a decision-theoretic approach, centering on the computation of the expected value of information of a probe, weighing the cost of the short-term disruptiveness of probes with their benefits in enhancing the long-term performance of predictive models. We test the different approaches in a field study, focused on the task of learning predictive models of the cost of interruption.",
        "session": "SESSION: Knowledge Elicitation"
    },
    {
        "title": "Investigating statistical machine learning as a tool for software development",
        "authors": "Kayur Patel, James Fogarty, James A. Landay, Beverly Harrison",
        "abstract": "As statistical machine learning algorithms and techniques continue to mature, many researchers and developers see statistical machine learning not only as a topic of expert study, but also as a tool for software development. Extensive prior work has studied software development, but little prior work has studied software developers applying statistical machine learning. This paper presents interviews of eleven researchers experienced in applying statistical machine learning algorithms and techniques to human-computer interaction problems, as well as a study of ten participants working during a five-hour study to apply statistical machine learning algorithms and techniques to a realistic problem. We distill three related categories of difficulties that arise in applying statistical machine learning as a tool for software development: (1) difficulty pursuing statistical machine learning as an iterative and exploratory process, (2) difficulty understanding relationships between data and the behavior of statistical machine learning algorithms, and (3) difficulty evaluating the performance of statistical machine learning algorithms and techniques in the context of applications. This paper provides important new insight into these difficulties and the need for development tools that better support the application of statistical machine learning.",
        "session": "SESSION: Knowledge Elicitation"
    },
    {
        "title": "CiteSense: supporting sensemaking of research literature",
        "authors": "Xiaolong Zhang, Yan Qu, C. Lee Giles, Piyou Song",
        "abstract": "Making sense of research literature is a complicated process that involves various information seeking and compre-hension tasks. The lack of support for sensemaking in existing systems presents important design challenges and opportunities. This research proposes the design of an integral environment to support literature search, selection, organization and comprehension. Our system prototype, CiteSense, offers lightweight interaction tools and a smooth transition among various information activities. This research deepens our understanding of the design of systems that support the sensemaking of research literature.",
        "session": "SESSION: Knowledge Elicitation"
    },
    {
        "title": "The personal project planner: planning to organize personal information",
        "authors": "William Jones, Predrag Klasnja, Andrea Civan, Michael L. Adcock",
        "abstract": "Prototyping and evaluation combine to explore ways that an effective, integrative organization of project-related information might emerge as a by-product of a person's efforts to plan a project. The Personal Project Planner works as an extension to the file manager -- providing people with rich-text overlays to their information. Document-like project plans provide a context in which to create or reference documents, email messages, web pages, etc. that are needed to complete the plan. The user can later locate an information item such as an email message with reference to the plan (e.g., as an alternative to searching through the inbox or sent mail). Results of an interim evaluation of the Planner are very promising and suggest special directions of focus for limited available prototyping resources.",
        "session": "SESSION: Knowledge Elicitation"
    },
    {
        "title": "CareLog: a selective archiving tool for behavior management in schools",
        "authors": "Gillian R. Hayes, Lamar M. Gardere, Gregory D. Abowd, Khai N. Truong",
        "abstract": "Identifying the function of problem behavior can lead to the development of more effective interventions. One way to identify the function is through functional behavior assessment (FBA). Teachers conduct FBA in schools. However, the task load of recording the data manually is high, and the challenge of accurately identifying antecedents and consequences is significant while interacting with students. These issues often result in imperfect information capture. CareLog allows teachers more easily to conduct FBAs and enhances the capture of relevant information. In this paper, we describe the design process that led to five design principles that governed the development of CareLog. We present results from a five-month, quasi-controlled study aimed at validating those design principles. We reflect on how various constraints imposed by special education settings impact the design and evaluation process for HCI practitioners and researchers.",
        "session": "SESSION: Tools for Education"
    },
    {
        "title": "Observing presenters' use of visual aids to inform the design of classroom presentation software",
        "authors": "Joel Lanir, Kellogg S. Booth, Leah Findlater",
        "abstract": "Large classrooms have traditionally provided multiple blackboards on which an entire lecture could be visible. In recent decades, classrooms were augmented with a data projector and screen, allowing computer-generated slides to replace hand-written blackboard presentations and overhead transparencies as the medium of choice. Many lecture halls and conference rooms will soon be equipped with multiple projectors that provide large, high-resolution displays of comparable size to an old fashioned array of blackboards. The predominant presentation software, however, is still designed for a single medium-resolution projector. With the ultimate goal of designing rich presentation tools that take full advantage of increased screen resolution and real estate, we conducted an observational study to examine current practice with both traditional whiteboards and blackboards, and computer-generated slides. We identify several categories of observed usage, and highlight differences between traditional media and computer slides. We then present design guidelines for presentation software that capture the advantages of the old and the new and describe a working prototype based on those guidelines that more fully utilizes the capabilities of multiple displays.",
        "session": "SESSION: Tools for Education"
    },
    {
        "title": "Readability of scanned books in digital libraries",
        "authors": "Alexander J. Quinn, Chang Hu, Takeshi Arisaka, Anne Rose, Benjamin B. Bederson",
        "abstract": "Displaying scanned book pages in a web browser is difficult, due to an array of characteristics of the common user's configuration that compound to yield text that is degraded and illegibly small. For books which contain only text, this can often be solved by using OCR or manual transcription to extract and present the text alone, or by magnifying the page and presenting it in a scrolling panel. Books with rich illustrations, especially children's picture books, present a greater challenge because their enjoyment is dependent on reading the text in the context of the full page with its illustrations. We have created two novel prototypes for solving this problem by magnifying just the text, without magnifying the entire page. We present the results of a user study of these techniques. Users found our prototypes to be more effective than the dominant interface type for reading this kind of material and, in some cases, even preferable to the physical book itself.",
        "session": "SESSION: Tools for Education"
    },
    {
        "title": "Choice: abidcating or exercising?",
        "authors": "Tuck Leong, Steve Howard, Frank Vetere",
        "abstract": "Many people today have access to enormous libraries of digital content. Increasingly these libraries contain personal content, consumed in support of people's non-instrumental needs. If current trends persist, these repositories will only increase. Having to choose from so much could be unpleasant especially in the absence of strong preferences. This raises some concerns for user experience (UX) design. Approaches for such interactions should not only be optimized for UX but must also support users' non-instrumental needs. People face this predicament during digital music listening and yet report positive experiences when listening in shuffle. Through an empirical study of digital music listening and close examination of people's listening practices and experiences, we argue that a shuffle-based approach--whereby people can abdicate choice to a random process while being able to modulate the randomness--not only mitigates the unpleasantness of choosing but also supports their non-instrumental needs while fostering desirable experiential outcomes.",
        "session": "SESSION: Sound of Music"
    },
    {
        "title": "MySong: automatic accompaniment generation for vocal melodies",
        "authors": "Ian Simon, Dan Morris, Sumit Basu",
        "abstract": "We introduce MySong, a system that automatically chooses chords to accompany a vocal melody. A user with no musical experience can create a song with instrumental accompaniment just by singing into a microphone, and can experiment with different styles and chord patterns using interactions designed to be intuitive to non-musicians. We describe the implementation of MySong, which trains a Hidden Markov Model using a music database and uses that model to select chords for new melodies. Model parameters are intuitively exposed to the user. We present results from a study demonstrating that chords assigned to melodies using MySong and chords assigned manually by musicians receive similar subjective ratings. We then present results from a second study showing that thirteen users with no background in music theory are able to rapidly create musical accompaniments using MySong, and that these accompaniments are rated positively by evaluators.",
        "session": "SESSION: Sound of Music"
    },
    {
        "title": "PlaceAndPlay: a digital tool for children to create and record music",
        "authors": "Yasushi Akiyama, Sageev Oore",
        "abstract": "We present a novel interface for young children to interact with digital music. PlaceAndPlay provides an intuitive environment for children with no music creation experience. Multimodal interaction techniques and a unique approach to music layout accommodate physical and cognitive abilities of young children. The system was evaluated in user study settings at the different designing stages and the results were positive.",
        "session": "SESSION: Sound of Music"
    },
    {
        "title": "The sound of touch: physical manipulation of digital sound",
        "authors": "David Merrill, Hayes Raffle, Roberto Aimi",
        "abstract": "The Sound of Touch is a new tool for real-time capture and sensitive physical stimulation of sound samples using digital convolution. Our hand-held wand can be used to (1) record sound, then (2) play back the recording by brushing, scraping, striking or otherwise physically manipulating the wand against physical objects. During playback, the recorded sound is continuously filtered by the acoustic interaction of the wand and the material being touched. The Sound of Touch enables a physical and continuous sculpting of sound that is typical of acoustic musical instruments and interactions with natural objects and materials, but not available in GUI-based tools or most electronic music instruments. This paper reports the design of the system and observations of thousands of users interacting with it in an exhibition format. Preliminary user feedback suggests future applications to foley, professional sound design, and musical performance.",
        "session": "SESSION: Sound of Music"
    },
    {
        "title": "Asynchronous remote medical consultation for Ghana",
        "authors": "Rowena Luk, Melissa Ho, Paul M. Aoki",
        "abstract": "Computer-mediated communication systems can be used to bridge the gap between doctors in underserved regions with local shortages of medical expertise and medical specialists worldwide. To this end, we describe the design of a prototype remote consultation system intended to provide the social, institutional and infrastructural context for sustained, self-organizing growth of a globally-distributed Ghanaian medical community. The design is grounded in an iterative design process that included two rounds of extended design fieldwork throughout Ghana and draws on three key design principles (social networks as a framework on which to build incentives within a self-organizing network; optional and incremental integration with existing referral mechanisms; and a weakly-connected, distributed architecture that allows for a highly interactive, responsive system despite failures in connectivity). We discuss initial experiences from an ongoing trial deployment in southern Ghana.",
        "session": "SESSION: Healthcare in the Developing World"
    },
    {
        "title": "E-imci: improving pediatric health care in low-income countries",
        "authors": "Brian DeRenzi, Neal Lesh, Tapan Parikh, Clayton Sims, Werner Maokla, Mwajuma Chemba, Yuna Hamisi, David S hellenberg, Marc Mitchell, Gaetano Borriello",
        "abstract": "Every year almost 10 million children die before reaching the age of five despite the fact that two-thirds of these deaths could be prevented by effective low-cost interventions. To combat this, the World Health Organization (WHO) and UNICEF developed the Integrated Management of Childhood Illness (IMCI) treatment algorithms. In Tanzania, IMCI is the national policy for the treatment of childhood illness. This paper describes e-IMCI, a system for administering the IMCI protocol using a PDA. Our preliminary investigation in rural Tanzania suggests that e-IMCI is almost as fast as the common practice and potentially improves care by increasing adherence to the IMCI protocols. Additionally, we found clinicians could quickly be trained to use e-IMCI and were very enthusiastic about using it in the future.",
        "session": "SESSION: Healthcare in the Developing World"
    },
    {
        "title": "Participant and interviewer attitudes toward handheld computers in the context of HIV/AIDS programs in sub-Saharan Africa",
        "authors": "Karen G. Cheng, Francisco Ernesto, Khai N. Truong",
        "abstract": "Handheld computers have untapped potential to improve HIV/AIDS programs in sub-Saharan Africa, particularly in the collection of survey data. We conducted an experiment in three neighborhoods of Luanda, Angola to assess the impact of the technology on people's comfort and willingness to disclose sensitive personal information, such as sexual behavior. Participants were asked about their HIV/AIDS-related knowledge, attitudes, and practices by local interviewers using either handheld computers or paper surveys. T-tests showed no differences between participants' self-reported comfort across handheld and paper conditions. However, participants in the handheld condition were more likely to give socially desirable responses to the sexual behavior questions than participants in the paper condition. These results suggest that using handheld computers in data collection in sub-Saharan Africa may lead to biased reports of HIV/AIDS-related risk behaviors.",
        "session": "SESSION: Healthcare in the Developing World"
    },
    {
        "title": "It's on my other computer!: computing with multiple devices",
        "authors": "David Dearman, Jeffery S. Pierce",
        "abstract": "The number of computing devices that people use is growing. To gain a better understanding of why and how people use multiple devices, we interviewed 27 people from academia and industry. From these interviews we distill four primary findings. First, associating a user's activities with a particular device is problematic for multiple device users because many activities span multiple devices. Second, device use varies by user and circumstance; users assign different roles to devices both by choice and by constraint. Third, users in industry want to separate work and personal activities across work and personal devices, but they have difficulty doing so in practice Finally, users employ a variety of techniques for accessing information across devices, but there is room for improvement: participants reported managing information across their devices as the most challenging aspect of using multiple devices. We suggest opportunities to improve the user experience by focusing on the user rather than the applications and devices; making devices aware of their roles; and providing lighter-weight methods for transferring information, including synchronization services that engender more trust from users.",
        "session": "SESSION: Displayful and Displayless"
    },
    {
        "title": "Targeting across displayless space",
        "authors": "Miguel A. Nacenta, Regan L. Mandryk, Carl Gutwin",
        "abstract": "Multi-monitor displays and multi-display environments are now common. Cross-display cursor movement, in which a user moves the pointer from one display to another, occurs frequently in these settings. There are several techniques for supporting this kind of movement, and these differ in the way that they deal with displayless space (the physical space between displays). Stitching is the method used by most operating systems; in this technique, the cursor jumps from the edge of one display directly into the next display. In contrast, Mouse Ether maps the motor space of the mouse exactly to the physical space of the displays, meaning that the cursor has to travel across displayless space until it reaches the next display. To determine which of these approaches is best for cross-display movement, we carried out a study comparing Stitching, Mouse Ether, and a variant of Mouse Ether with Halo for off-screen feedback. We found that Stitching is equivalent to or faster than any variant of Mouse Ether, and that Halo improves Ether's performance (but not enough to outperform Stitching). Results also indicate that the larger the gap between displays, the longer the targeting takes --- even for Stitching. These findings provide valuable guidance for practitioners and raise new interesting questions for research.",
        "session": "SESSION: Displayful and Displayless"
    },
    {
        "title": "Wedge: clutter-free visualization of off-screen locations",
        "authors": "Sean Gustafson, Patrick Baudisch, Carl Gutwin, Pourang Irani",
        "abstract": "To overcome display limitations of small-screen devices, researchers have proposed techniques that point users to objects located off-screen. Arrow-based techniques such as City Lights convey only direction. Halo conveys direction and distance, but is susceptible to clutter resulting from overlapping halos. We present Wedge, a visualization technique that conveys direction and distance, yet avoids overlap and clutter. Wedge represents each off-screen location using an acute isosceles triangle: the tip coincides with the off-screen locations, and the two corners are located on-screen. A wedge conveys location awareness primarily by means of its two legs pointing towards the target. Wedges avoid overlap programmatically by repelling each other, causing them to rotate until overlap is resolved. As a result, wedges can be applied to numbers and configurations of targets that would lead to clutter if visualized using halos. We report on a user study comparing Wedge and Halo for three off-screen tasks. Participants were significantly more accurate when using Wedge than when using Halo.",
        "session": "SESSION: Displayful and Displayless"
    },
    {
        "title": "Assessing attractiveness in online dating profiles",
        "authors": "Andrew T. Fiore, Lindsay Shaw Taylor, G.A. Mendelsohn, Marti Hearst",
        "abstract": "Online dating systems play a prominent role in the social lives of millions of their users, but little research has considered how users perceive one another through their personal profiles. We examined how users perceive attractiveness in online dating profiles, which provide their first exposure to a potential partner. Participants rated whole profiles and profile components on such qualities as how attractive, extraverted, and genuine and trustworthy they appeared. As past research in the psychology of attraction would suggest, the attractiveness and other qualities of the photograph were the strongest predictors of whole profile attractiveness, but they were not alone: the free-text component also played an important role in predicting overall attractiveness. In turn, numerous other qualities predicted the attractiveness ratings of photos and free-text components, albeit in different ways for men and women. The fixed-choice elements of a profile, however, were unrelated to attractiveness.",
        "session": "SESSION: Friends, Foe, and Family"
    },
    {
        "title": "Keeping in touch by technology: maintaining friendships after a residential move",
        "authors": "Irina Shklovski, Robert Kraut, Jonathon Cummings",
        "abstract": "Many observers have praised new communication technologies for providing convenient and affordable tools for maintaining relationships at a distance. Yet the precise role of mediated communication in relationship maintenance has been difficult to isolate. In this paper, we treat residential moves as natural experiments that threaten existing social relationships and often force people to rely on mediated communication to maintain their old relationships. Results from a 3-wave survey of 900 residential movers describing 1892 relationships shows that email and the telephone play different roles in social relationships. Email helps maintain social relationships, in the sense that relationships decline when email drops after the move. However increases in email are not associated with increases in the depth of the relationship or exchanges of support. In contrast, phone calls help movers grow relationships and exchange social support.",
        "session": "SESSION: Friends, Foe, and Family"
    },
    {
        "title": "Friends and foes: ideological social networking",
        "authors": "Michael J. Brzozowski, Tad Hogg, Gabor Szabo",
        "abstract": "Traditional online social network sites use a single monolithic \"friends\" relationship to link users. However, users may have more in common with strangers, suggesting the use of a \"similarity network\" to recommend content. This paper examines the usefulness of this distinction in propagating new content. Using both macroscopic and microscopic social dynamics, we present an analysis of Essembly, an ideological social network that semantically distinguishes between friends and ideological allies and nemeses. Although users have greater similarity with their allies than their friends and nemeses, surprisingly, the allies network does not affect voting behavior, despite being as large as the friends network. In contrast, users are influenced differently by their friends and nemeses, indicating that people use these networks for distinct purposes. We suggest resulting design implications for social content aggregation services and recommender systems.",
        "session": "SESSION: Friends, Foe, and Family"
    },
    {
        "title": "Life scheduling to support multiple social roles",
        "authors": "Andrea Grimes, A.J. Brush",
        "abstract": "We present the results of our study of 15 working parents, and how they manage their life scheduling needs, that is, how they manage their personal and professional schedules across settings and calendaring tools. In particular, we discuss how their dual roles of parent and employee compel them to record personal information on their professional calendars and we detail the tensions that arise in doing so. Finally, we present suggestions for future calendaring applications that better support working parents in managing their life scheduling needs.",
        "session": "SESSION: Friends, Foe, and Family"
    },
    {
        "title": "Collaborating to remember: a distributed cognition account of families coping with memory impairments",
        "authors": "Mike Wu, Jeremy Birnholtz, Brian Richards, Ronald Baecker, Mike Massimi",
        "abstract": "Individuals with cognitive deficits and their families are prime examples of collaborative \"systems\" that seek to perform everyday tasks together. Yet there has been little investigation into how these families communicate and coordinate in basic tasks like remembering appointments. In this paper we take a distributed cognition approach to studying ten families struggling with amnesia through nonparticipant observation and interviews. Our data show that the families work closely together as cognitive systems that must compensate for memory volatility in one of the members. We explore our participants' strategies for overcoming these difficulties and present lessons for the design of assistive technologies, highlighting the need for redundancy, easy and frequent synchronization, and awareness of updates. We conclude with implications for distributed cognition theory.",
        "session": "SESSION: Cognition, Perception, and Memory"
    },
    {
        "title": "Feasibility and pragmatics of classifying working memory load with an electroencephalograph",
        "authors": "David Grimes, Desney S. Tan, Scott E. Hudson, Pradeep Shenoy, Rajesh P.N. Rao",
        "abstract": "A reliable and unobtrusive measurement of working memory load could be used to evaluate the efficacy of interfaces and to provide real-time user-state information to adaptive systems. In this paper, we describe an experiment we con-ducted to explore some of the issues around using an elec-troencephalograph (EEG) for classifying working memory load. Within this experiment, we present our classification methodology, including a novel feature selection scheme that seems to alleviate the need for complex drift modeling and artifact rejection. We demonstrate classification accuracies of up to 99% for 2 memory load levels and up to 88% for 4 levels. We also present results suggesting that we can do this with shorter windows, much less training data, and a smaller number of EEG channels, than reported previously. Finally, we show results suggesting that the models we construct transfer across variants of the task, implying some level of generality. We believe these findings extend prior work and bring us a step closer to the use of such technologies in HCI research.",
        "session": "SESSION: Cognition, Perception, and Memory"
    },
    {
        "title": "Human-aided computing: utilizing implicit human processing to classify images",
        "authors": "Pradeep Shenoy, Desney S. Tan",
        "abstract": "In this paper, we present Human-Aided Computing, an approach that uses an electroencephalograph (EEG) device to measure the presence and outcomes of implicit cognitive processing, processing that users perform automatically and may not even be aware of. We describe a classification system and present results from two experiments as proof-of-concept. Results from the first experiment showed that our system could classify whether a user was looking at an image of a face or not, even when the user was not explicitly trying to make this determination. Results from the second experiment extended this to animals and inanimate object categories as well, suggesting generality beyond face recognition. We further show that we can improve classification accuracies if we show images multiple times, potentially to multiple people, attaining well above 90% classification accuracies with even just ten presentations.",
        "session": "SESSION: Cognition, Perception, and Memory"
    },
    {
        "title": "Framing the user experience: information biases on website quality judgement",
        "authors": "Jan Hartmann, Antonella De Angeli, Alistair Sutcliffe",
        "abstract": "Understanding the complexities of users' judgements and user experience is a prerequisite for informing HCI design. Current user experience (UX) research emphasises that, beyond usability, non-instrumental aspects of system quality contribute to overall judgement and that the user experience is subjective and variable. Based on judgement and decision-making theory, we have previously demonstrated that judgement of websites can be influenced by contextual factors. This paper explores the strength of such contextual influence by investigating framing effects on user judgement of website quality. Two experimental studies investigate how the presentation of information about a website influences the user experience and the relative importance of individual quality attributes for overall judgement. Theoretical implications for the emerging field of UX research and practical implications for design are discussed.",
        "session": "SESSION: Exploring Web Content"
    },
    {
        "title": "Predictors of answer quality in online Q&A sites",
        "authors": "F. Maxwell Harper, Daphne Raban, Sheizaf Rafaeli, Joseph A. Konstan",
        "abstract": "Question and answer (Q&A) sites such as Yahoo! Answers are places where users ask questions and others answer them. In this paper, we investigate predictors of answer quality through a comparative, controlled field study of responses provided across several online Q&A sites. Along with several quantitative results concerning the effects of factors such as question topic and rhetorical strategy, we present two high-level messages. First, you get what you pay for in Q&A sites. Answer quality was typically higher in Google Answers (a fee-based site) than in the free sites we studied, and paying more money for an answer led to better outcomes. Second, we find that a Q&A site's community of users contributes to its success. Yahoo! Answers, a Q&A site where anybody can answer questions, outperformed sites that depend on specific individuals to answer questions, such as library reference services.",
        "session": "SESSION: Exploring Web Content"
    },
    {
        "title": "AutoCardSorter: designing the information architecture of a web site using latent semantic analysis",
        "authors": "Christos Katsanos, Nikolaos Tselios, Nikolaos Avouris",
        "abstract": "In this paper, we describe an innovative tool that supports the design and evaluation of the information architecture of a Web site. The tool uses Latent Semantic Analysis and hierarchical clustering algorithms to provide optimal information navigation schemes in an automated manner. The proposed, tool-based, approach addresses the problem of reasonable content structuring, which established techniques such as card sorting also address. A real world case study depicted substantial effectiveness gain, without expense in the quality of results. We argue that such an approach could facilitate information-rich applications design, like most Web sites, by reducing time and resources required.",
        "session": "SESSION: Exploring Web Content"
    },
    {
        "title": "Designing for bystanders: reflections on building a public digital forum",
        "authors": "Anthony Tang, Mattias Finke, Michael Blackstock, Rock Leung, Meghan Deutscher, Rodger Lea",
        "abstract": "In this paper, we reflect on the design and deployment process of MAGICBoard, a public display deployed in a university setting that solicits the electronic votes and opinions of bystanders on trivial but amusing topics. We focus on the consequences of our design choices with respect to encouraging bystanders to interact with the public display. Bystanders are individuals around the large display who may never fully engage with the application itself, but are potential contributors to the system. Drawing on our recent experiences with MAGICBoard, we present a classification of bystanders, and then discuss three design themes relevant to the design of systems for bystander use: graduated proximal engagement, lowering barriers for interaction and supporting covert engagement.",
        "session": "SESSION: Exploring Web Content"
    },
    {
        "title": "Electronic voting machines versus traditional methods: improved preference, similar performance",
        "authors": "Sarah P. Everett, Kristen K. Greene, Michael D. Byrne, Dan S. Wallach, Kyle Derr, Daniel Sandler, Ted Torous",
        "abstract": "",
        "session": "SESSION: Measuring, Business, and Voting"
    },
    {
        "title": "Introducing item response theory for measuring usability inspection processes",
        "authors": "Martin Schmettow, Wolfgang Vietze",
        "abstract": "",
        "session": "SESSION: Measuring, Business, and Voting"
    },
    {
        "title": "Making use of business goals in usability evaluation: an experiment with novice evaluators",
        "authors": "Kasper Hornbæk, Erik Frøkjær",
        "abstract": "",
        "session": "SESSION: Measuring, Business, and Voting"
    },
    {
        "title": "Evaluating visual cues for window switching on large screens",
        "authors": "Raphael Hoffmann, Patrick Baudisch, Daniel S. Weld",
        "abstract": "An increasing number of users are adopting large, multi-monitor displays. The resulting setups cover such a broad viewing angle that users can no longer simultaneously perceive all parts of the screen. Changes outside the user's visual field often go unnoticed. As a result, users sometimes have trouble locating the active window, for example after switching focus. This paper surveys graphical cues designed to direct visual attention and adapts them to window switching. Visual cues include five types of frames and mask around the target window and four trails leading to the window. We report the results of two user studies. The first evaluates each cue in isolation. The second evaluates hybrid techniques created by combining the most successful candidates from the first study. The best cues were visually sparse --- combinations of curved frames which use color to pop-out and tapered trails with predictable origin.",
        "session": "SESSION: Multiple and Large Displays"
    },
    {
        "title": "Impromptu: a new interaction framework for supporting collaboration in multiple display environments and its field evaluation for co-located software development",
        "authors": "Jacob T. Biehl, William T. Baker, Brian P. Bailey, Desney S. Tan, Kori M. Inkpen, Mary Czerwinski",
        "abstract": "We present a new interaction framework for collaborating in multiple display environments (MDEs) and report results from a field study investigating its use in an authentic work setting. Our interaction framework, IMPROMPTU, allows users to share task information across displays via off-the-shelf applications, to jointly interact with information for focused problem solving and to place information on shared displays for discussion and reflection. Our framework also includes a lightweight interface for performing these and related actions. A three week field study of our framework was conducted in the domain of face-to-face group software development. Results show that teams utilized almost every feature of the framework in support of a wide range of development-related activities. The framework was used most to facilitate opportunistic collaboration involving task information. Teams reported wanting to continue using the framework as they found value in it overall.",
        "session": "SESSION: Multiple and Large Displays"
    },
    {
        "title": "Ninja cursors: using multiple cursors to assist target acquisition on large screens",
        "authors": "Masatomo Kobayashi, Takeo Igarashi",
        "abstract": "We propose the \"ninja cursor\" to improve the performance of target acquisition, particularly on large screens. This technique uses multiple distributed cursors to reduce the average distance to targets. Each cursor moves synchronously following mouse movement. We present the design and implementation of the proposed technique, including a method to resolve the ambiguity that results when multiple cursors indicate different targets simultaneously. We also conducted an experiment to assess the performance of the ninja cursor. The results indicate that it can generally reduce movement time. However, the performance is greatly affected by the number of cursors and target density. Based on these results, we discuss how our technique can be put into practical use. In addition to presenting a novel method to improve pointing performance, our study is the first to explore a variable number of cursors for performing pointing tasks.",
        "session": "SESSION: Multiple and Large Displays"
    },
    {
        "title": "Generalized selection via interactive query relaxation",
        "authors": "Jeffrey Heer, Maneesh Agrawala, Wesley Willett",
        "abstract": "Selection is a fundamental task in interactive applications, typically performed by clicking or lassoing items of interest. However, users may require more nuanced forms of selection. Selecting regions or attributes may be more important than selecting individual items. Selections may be over dynamic items and selections might be more easily created by relaxing simpler selections (e.g., \"select all items like this one\"). Creating such selections requires that interfaces model the declarative structure of the selection, not just individually selected items. We present direct manipulation techniques that couple declarative selection queries with a query relaxation engine that enables users to interactively generalize their selections. We apply our selection techniques in both information visualization and graphics editing applications, enabling generalized selection over both static and dynamic interface objects. A controlled study finds that users create more accurate selection queries when using our generalization techniques.",
        "session": "SESSION: Mixed-Initiative Interaction"
    },
    {
        "title": "Implicit user-adaptive system engagement in speech and pen interfaces",
        "authors": "Sharon Oviatt, Colin Swindells, Alex Arthur",
        "abstract": "As emphasis is placed on developing mobile, educational, and other applications that minimize cognitive load on users, it is becoming more essential to explore interfaces based on implicit engagement techniques so users can remain focused on their tasks. In this research, data were collected with 12 pairs of students who solved complex math problems using a tutorial system that they engaged over 100 times per session entirely implicitly via speech amplitude or pen pressure cues. Results revealed that users spontaneously, reliably, and substantially adapted these forms of communicative energy to designate and repair an intended interlocutor in a computer-mediated group setting. Furthermore, this behavior was harnessed to achieve system engagement accuracies of 75-86%, with accuracies highest using speech amplitude. However, students had limited awareness of their own adaptations. Finally, while continually using these implicit engagement techniques, students maintained their performance level at solving complex mathematics problems throughout a one-hour session.",
        "session": "SESSION: Mixed-Initiative Interaction"
    },
    {
        "title": "Mixed-initiative dialog management for speech-based interaction with graphical user interfaces",
        "authors": "Andreas Löhr, Bernd Brügge",
        "abstract": "Controlling graphical user interfaces (GUI) by speech is slow, but proves useful for disabled persons with limitations in operating mouse and keyboard. We present conversation-and-control, a new approach for using speech as input modality for GUIs, which facilitates direct manipulation of widget functions by spoken commands. Our approach is based on a command language, which provides a unique command for each specific widget function. For managing the interaction we propose a mixed-initiative dialog model, which can be generated from widget properties. Using heuristics for inferring the meaning of a recognition result and having the ability to ask clarification questions, our approach avoids the rejection of recognition errors. We hypothesized that conversation-and-control allows for shorter task completion times than conventional command-and-control approaches, due to a reduction of the average number of required commands. The results of a user experiment, which we present and discuss, indicate a 16.8% reduction of task completion time achieved by our approach.",
        "session": "SESSION: Mixed-Initiative Interaction"
    },
    {
        "title": "Augmented information assimilation: social and algorithmic web aids for the information long tail",
        "authors": "Brynn Evans, Stuart Card",
        "abstract": "To understand how and why individuals make use of emerging information assimilation services on the Web as part of their daily routine, we combined video recordings of online activity with targeted interviews of eleven experienced web users. From these observations, we describe their choice of systems, the goals they are trying to achieve, their information diets, the basic process they use for assimilating information, and the impact of user interface speed.",
        "session": "SESSION: Help Me Search"
    },
    {
        "title": "What to do when search fails: finding information by association",
        "authors": "Duen Horng Chau, Brad Myers, Andrew Faulring",
        "abstract": "Sometimes people cannot remember the names or locations of things on their computer, but they can remember what other things are associated with them. We created Feldspar, the first system that fully supports this associative retrieval of personal information on the computer. Feldspar's contributions include (1) an intuitive user interface that allows users to find information by interactively and incrementally specifying multiple levels of associations as retrieval queries, such as: \"find the file from the person who I met at an event in May\"; and (2) algorithms for collecting the association information and for providing answers to associative queries in real-time. A user study showed that Feldspar is easy to use, and suggested that it might be faster than conventional browsing and searching for these kinds of retrieval tasks. Feldspar could be an important addition to search and browsing tools.",
        "session": "SESSION: Help Me Search"
    },
    {
        "title": "Conversation pivots and double pivots",
        "authors": "Daniel Xiaodan Zhou, Nathan Oostendorp, Michael Hess, Paul Resni k",
        "abstract": "Many sites on the web offer collaborative databases that catalog items such as bands, events, products, or software modules. Conversation pivots allow readers to navigate from pages about these items to conversations about them on the same site or elsewhere on the Internet. Double pivots allow readers to navigate from item pages to pages about other items mentioned in the same conversations. Using text mining techniques specific to the collection it is possible to find references to collected items in online conversations. We implemented conversation pivots for the CPAN archive of Perl modules, and for Drupal.org, the reference site for the Drupal content management system.",
        "session": "SESSION: Help Me Search"
    },
    {
        "title": "Query suggestions for mobile search: understanding usage patterns",
        "authors": "Maryam Kamvar, Shumeet Baluja",
        "abstract": "Entering search terms on mobile phones is a time consuming and cumbersome task. In this paper, we explore the usage patterns of query entry interfaces that display suggestions. Our primary goal is to build a usage model of query suggestions in order to provide user interface guidelines for mobile text prediction interfaces. We find that users who were asked to enter queries on a search interface with query suggestions rated their workload lower and their enjoyment higher. They also saved, on average, approximately half of the key presses compared to users who were not shown suggestions, despite no associated decrease in time to enter a query. Surprisingly, users also accepted suggestions when the process of doing so resulted in an increase in the number of total key presses.",
        "session": "SESSION: Help Me Search"
    },
    {
        "title": "Harvesting with SONAR: the value of aggregating social network information",
        "authors": "Ido Guy, Michal Jacovi, Elad Shahar, Noga Meshulam, Vladimir Soroka, Stephen Farrell",
        "abstract": "Web 2.0 gives people a substantial role in content and metadata creation. New interpersonal connections are formed and existing connections become evident through Web 2.0 services. This newly created social network (SN) spans across multiple services and aggregating it could bring great value. In this work we present SONAR, an API for gathering and sharing SN information. We give a detailed description of SONAR, demonstrate its potential value through user scenarios, and show results from experiments we conducted with a SONAR-based social networking application. These suggest that aggregating SN information across diverse data sources enriches the SN picture and makes it more complete and useful for the end user.",
        "session": "SESSION: Online Social Networks"
    },
    {
        "title": "Looking at, looking up or keeping up with people?: motives and use of facebook",
        "authors": "Adam N. Joinson",
        "abstract": "This paper investigates the uses of social networking site Facebook, and the gratifications users derive from those uses. In the first study, 137 users generated words or phrases to describe how they used Facebook, and what they enjoyed about their use. These phrases were coded into 46 items which were completed by 241 Facebook users in Study 2. Factor analysis identified seven unique uses and gratifications: social connection, shared identities, content, social investigation, social network surfing and status updating. User demographics, site visit patterns and the use of privacy settings were associated with different uses and gratifications.",
        "session": "SESSION: Online Social Networks"
    },
    {
        "title": "Lifting the veil: improving accountability and social transparency in Wikipedia with wikidashboard",
        "authors": "Bongwon Suh, Ed H. Chi, Aniket Kittur, Bryan A. Pendleton",
        "abstract": "Wikis are collaborative systems in which virtually anyone can edit anything. Although wikis have become highly popular in many domains, their mutable nature often leads them to be distrusted as a reliable source of information. Here we describe a social dynamic analysis tool called WikiDashboard which aims to improve social transparency and accountability on Wikipedia articles. Early reactions from users suggest that the increased transparency afforded by the tool can improve the interpretation, communication, and trustworthiness of Wikipedia articles.",
        "session": "SESSION: Online Social Networks"
    },
    {
        "title": "Social tagging roles: publishers, evangelists, leaders",
        "authors": "Jennifer Thom-Santelli, Michael J. Muller, David R. Millen",
        "abstract": "Social tagging systems provide users with the opportunity to employ tags in a communicative manner. To explore the use of tags for communication in these systems, we report results from 33 user interviews and employ the concept of social roles to describe audience-oriented tagging, including roles of community-seeker, community-builder, evangelist, publisher, and team-leader. These roles contribute to our understanding of the motivations and rationales behind social tagging in an international company, and suggest new features and services to support social software in the enterprise.",
        "session": "SESSION: Online Social Networks"
    },
    {
        "title": "Sesame: informing user security decisions with system visualization",
        "authors": "Jennifer Stoll, Craig S. Tashman, W. Keith Edwards, Kyle Spafford",
        "abstract": "",
        "session": "SESSION: Am I Safe"
    },
    {
        "title": "Talc: using desktop graffiti to fight software vulnerability",
        "authors": "Kandha Sankarpandian, Travis Little, W. Keith Edwards",
        "abstract": "",
        "session": "SESSION: Am I Safe"
    },
    {
        "title": "You've been warned: an empirical study of the effectiveness of web browser phishing warnings",
        "authors": "Serge Egelman, Lorrie Faith Cranor, Jason Hong",
        "abstract": "",
        "session": "SESSION: Am I Safe"
    },
    {
        "title": "The adaptation of visual search strategy to expected information gain",
        "authors": "Yuan-Chi Tseng, Andrew Howes",
        "abstract": "An important question for HCI is to understand how and why visual search strategy is adapted to the demands imposed by the task of searching the results of a search engine. There is emerging evidence that a key part of the answer concerns the expected information gain of each of the set of available information gathering actions. We build on previous research to show that people are acutely sensitive to differences in the spacing and in the number of items returned by the search engine. These factors cause shifts in the efficiency of the available information gathering actions. We focus on an image browsing task, and show that, as a consequence of changes to the efficiency of available actions, people make small but significant changes to eye-movement strategy.",
        "session": "SESSION: Search"
    },
    {
        "title": "PeerChooser: visual interactive recommendation",
        "authors": "John O'Donovan, Barry Smyth, Brynjar Gretarsson, Svetlin Bostandjiev, Tobias Höllerer",
        "abstract": "Collaborative filtering (CF) has been successfully deployed over the years to compute predictions on items based on a user's correlation with a set of peers. The black-box nature of most CF applications leave the user wondering how the system arrived at its recommendation. This note introduces PeerChooser, a collaborative recommender system with an interactive graphical explanation interface. Users are provided with a visual explanation of the CF process and opportunity to manipulate their neighborhood at varying levels of granularity to reflect aspects of their current requirements. In this manner we overcome the problem of redundant profile information in CF systems, in addition to providing an explanation interface. Our layout algorithm produces an exact, noiseless graph representation of the underlying correlations between users. PeerChooser's prediction component uses this graph directly to yield the same results as the benchmark. User's then improve on these predictions by tweaking the graph to their current requirements. We present a user-survey in which PeerChooser compares favorably against a benchmark CF algorithm.",
        "session": "SESSION: Search"
    },
    {
        "title": "Pick me!: link selection in expertise search results",
        "authors": "N. Sadat Shami, Kate Ehrlich, David R. Millen",
        "abstract": "Expertise locator systems have been designed to help find experts within organizations. While there are many examples of these systems in the literature, there has not been any systematic analysis of the factors that predict whether a particular expertise search result will be selected for further exploration. This paper describes a study of 67 employees from 21 countries that performed a specific expertise search to find an expert using an expertise locator system. Rank order and social connection information displayed in snippets of search results were found to significantly predict whether a user considers a particular search result for further exploration. Implications for the design of expertise location systems and future research directions are discussed.",
        "session": "SESSION: Search"
    },
    {
        "title": "Searching for expertise",
        "authors": "Kate Ehrlich, N. Sadat Shami",
        "abstract": "It is well established that there is a need to find experts to get answers or advice. A variety of expertise locator tools have emerged to help locate the right person. But there is little systematic study on what people are really looking for when such systems are used and how external factors such as job role may shape that search. We conducted a study of 75 employees who were current users of an expertise locator system. An analysis of the reasons for their search revealed that people in client facing roles are primarily seeking to have a dialog with an expert, while others are just as likely to seek answers to technical questions. We also surveyed various tools for finding experts and found that corporate directories and personal networks were most often cited as alternatives to an expertise locator. We discuss the implications of these results for the design of tools for finding experts and expert knowledge.",
        "session": "SESSION: Search"
    },
    {
        "title": "What drives content tagging: the case of photos on Flickr",
        "authors": "Oded Nov, Mor Naaman, Chen Ye",
        "abstract": "We examine tagging behavior on Flickr, a public photo-sharing website. We build on previous qualitative research that exposed a taxonomy of tagging motivations, as well as on social presence research. The motivation taxonomy suggests that motivations for tagging are tied to the intended target audience of the tags --- the users themselves, family and friends, or the general public. Using multiple data sources, including a survey and independent system data, we examine which motivations are associated with tagging level, and estimate the magnitude of their contribution. We find that the levels of the Self and Public motivations, together with social presence indicators, are positively correlated with tagging level; Family & Friends motivations are not significantly correlated with tagging. The findings and the use of survey method carry implications for designers of tagging and other social systems on the web.",
        "session": "SESSION: Search"
    },
    {
        "title": "Don't look now, but we've created a bureaucracy: the nature and roles of policies and rules in wikipedia",
        "authors": "Brian Butler, Elisabeth Joyce, Jacqueline Pike",
        "abstract": "Wikis are sites that support the development of emergent, collective infrastructures that are highly flexible and open, suggesting that the systems that use them will be egalitarian, free, and unstructured. Yet it is apparent that the flexible infrastructure of wikis allows the development and deployment of a wide range of structures. However, we find that the policies in Wikipedia and the systems and mechanisms that operate around them are multi-faceted. In this descriptive study, we draw on prior work on rules and policies in organizations to propose and apply a conceptual framework for understanding the natures and roles of policies in wikis. We conclude that wikis are capable of supporting a broader range of structures and activities than other collaborative platforms. Wikis allow for and, in fact, facilitate the creation of policies that serve a wide variety of functions.",
        "session": "SESSION: Shared Authoring"
    },
    {
        "title": "Exploring the role of the reader in the activity of blogging",
        "authors": "Eric Baumer, Mark Sueyoshi, Bill Tomlinson",
        "abstract": "Within the last decade, blogs have become an important element of popular culture, mass media, and the daily lives of countless Internet users. Despite the medium's interactive nature, most research on blogs focuses on either the blog itself or the blogger, rarely if at all focusing on the reader's impact. In order to gain a better understanding of the social practice of blogging, we must take into account the role, contributions, and significance of the reader. This paper presents the findings of a qualitative study of blog readers, including common blog reading practices, some of the dimensions along which reading practices vary, relationships between identity presentation and perception, the interpretation of temporality, and the ways in which readers feel that they are a part of the blogs they read. It also describes similarities to, and discrepancies with, previous work, and suggests a number of directions and implications for future work on blogging.",
        "session": "SESSION: Shared Authoring"
    },
    {
        "title": "Emotion rating from short blog texts",
        "authors": "Alastair J. Gill, Darren Gergle, Robert M. French, Jon Oberlander",
        "abstract": "Being able to automatically perceive a variety of emotions from text alone has potentially important applications in CMC and HCI that range from identifying mood from online posts to enabling dynamically adaptive interfaces. However, such ability has not been proven in human raters or computational systems. Here we examine the ability of naive raters of emotion to detect one of eight emotional categories from 50 and 200 word samples of real blog text. Using expert raters as a 'gold standard', naive-expert rater agreement increased with longer texts, and was high for ratings of joy, disgust, anger and anticipation, but low for acceptance and 'neutral' texts. We discuss these findings in light of theories of CMC and potential applications in HCI.",
        "session": "SESSION: Shared Authoring"
    },
    {
        "title": "Word usage and posting behaviors: modeling blogs with unobtrusive data collection methods",
        "authors": "Adam D. I. Kramer, Kerry Rodden",
        "abstract": "We present a large-scale analysis of the content of weblogs dating back to the release of the Blogger program in 1999. Over one million blogs were analyzed from their conception through June 2006. These data was submitted to the Text Analysis: Word Counts program [12], which conducted a word-count analysis using Linguistic Inquiry and Word Counts (LIWC) dictionaries [20] to provide and analyze a representative sample of blogger word usage. Covariation among LIWC dictionaries suggests that blogs vary along five psychologically relevant linguistic dimensions: Melancholy, Socialness, Ranting, Metaphysicality, and Work-Relatedness. These variables and others were subjected to a cluster analysis in an attempt to extract natural usage groups to inform design of blogging systems, the results of which were mixed.",
        "session": "SESSION: Shared Authoring"
    },
    {
        "title": "Topobo in the wild: longitudinal evaluations of educators appropriating a tangible interface",
        "authors": "Amanda J. Parkes, Hayes Solos Raffle, Hiroshi Ishii",
        "abstract": "What issues arise when designing and deploying tangibles for learning in long term evaluations? This paper reports on a series of studies in which the Topobo system, a 3D tangible construction kit with the ability to record and playback motion, was provided to educators and designers to use over extended periods of time in the context of their day-to-day work. Tangibles for learning - like all educational materials - must be evaluated in relation both to the student and the teacher, but most studies of tangibles for learning focus on the student as user. Here, we focus on the conception of the educator, and their use of the tangible interface in the absence of an inventor or HCI researcher. The results of this study identify design and pedagogical issues that arise in response to distribution of a tangible for learning in different educational environments.",
        "session": "SESSION: Tangibles: Input & Output"
    },
    {
        "title": "You can touch, but you can't look: interacting with in-vehicle systems",
        "authors": "Kenneth Majlund Ba h, Mads Gregers Jæger, Mikael B. Skov, Nils Gram Thomassen",
        "abstract": "Car drivers are nowadays offered a wide array of in-vehicle systems i.e. route guidance systems, climate controls, music players. Such in-vehicle systems often require the driver's visual attention, but visual workload has shown significant less eyes-on-the-road time and affects driving performance. In this paper, we illustrate and compare three different interaction techniques for in-vehicle systems. We refer to them as tactile, touch, and gesture interaction. The focus of the techniques is the effects on drivers while driving cars. We evaluated the interaction techniques with 16 subjects in two settings. Our results showed that gesture interaction has a significant effect on the number of driver eye glances especially eye fixations of more seconds. However, gesture interaction still required rapid eye glances for hand/eye coordination. On the other hand, touch interaction leads to fast and efficient task completion while tactile interaction seemed inferior to the two other interaction techniques.",
        "session": "SESSION: Tangibles: Input & Output"
    },
    {
        "title": "Touchers and mousers: commonalities and differences in co-located collaboration with multiple input devices",
        "authors": "Christian Müller-Tomfelde, Claudia Schremmer",
        "abstract": "We present new findings on commonalities and differences between touch and mouse input for co-located interaction between teams of two people who know each other. Twenty-two participants were instructed to work as co-located pairs on three sets of two concurrent digital jigsaw puzzles, displayed on a horizontal tabletop that allows for multiple concurrent input devices. They were advised to use their preference for, or any combination of, direct (touch) and indirect (mouse) input device to achieve the goal. We increased the task?s difficulty: In the second and third puzzle task, participants had to discover that pieces were mixed up between the two puzzle stacks. We used this 'hidden task' to trigger spontaneous transitions from individual to collaborative work. Based on a qualitative analysis of individual interaction trajectories of direct and indirect input devices, we discuss patterns of collaboration. This furthers scientific understanding of co-located collaboration with multiple input devices.",
        "session": "SESSION: Tangibles: Input & Output"
    },
    {
        "title": "Information distance and orientation in liquid layout",
        "authors": "Joseph H. Goldberg, Jonathan I. Helfman, Lynne Martin",
        "abstract": "Liquid layout of web browser elements enables enterprise applications to adapt to larger windows on larger displays, but guidelines are needed to define layout rules for widescreen page content. The present study considers the impact of relative portlet distance and orientation in enterprise-type tasks. Eighteen analysts completed tasks in which critical information was located in two portlets separated by defined distances and orientations. Analysis of completion times, assists, errors, and subjective scales revealed a significant advantage for wider, horizontal information layouts over narrower, vertical layouts. The difference persisted, even when accounting for the influence of vertical scrolling. Horizontal layout in these dashboard-style tasks had a 5%-25% time savings over vertical layout, as separation distances increased to 2000 pixels. Differences in horizontal and vertical eye movement accuracy and velocity could account for these results. Widescreen design guidelines should include a preference for horizontal layout as horizontal screen distances increase.",
        "session": "SESSION: Tangibles: Input & Output"
    },
    {
        "title": "Activity-based serendipitous recommendations with the Magitti mobile leisure guide",
        "authors": "Victoria Bellotti, Bo Begole, Ed H. Chi, Nicolas Ducheneaut, Ji Fang, Ellen Isaacs, Tracy King, Mark W. Newman, Kurt Partridge, Bob Price, Paul Rasmussen, Michael Roberts, Diane J. Schiano, Alan Walendowski",
        "abstract": "This paper presents a context-aware mobile recommender system, codenamed Magitti. Magitti is unique in that it infers user activity from context and patterns of user behavior and, without its user having to issue a query, automatically generates recommendations for content matching. Extensive field studies of leisure time practices in an urban setting (Tokyo) motivated the idea, shaped the details of its design and provided data describing typical behavior patterns. The paper describes the fieldwork, user interface, system components and functionality, and an evaluation of the Magitti prototype.",
        "session": "SESSION: On the Move"
    },
    {
        "title": "Performing thrill: designing telemetry systems and spectator interfaces for amusement rides",
        "authors": "Holger Schnädelbach, Stefan Rennick Egglestone, Stuart Reeves, Steve Benford, Brendan Walker, Michael Wright",
        "abstract": "Fairground: Thrill Laboratory was a series of live events that augmented the experience of amusement rides. A wearable telemetry system captured video, audio, heart-rate and acceleration data, streaming them live to spectator interfaces and a watching audience. In this paper, we present a study of this event, which draws on video recordings and post-event interviews, and which highlights the experiences of riders, spectators and ride operators. Our study shows how the telemetry system transformed riders into performers, spectators into an audience, and how the role of ride operator began to include aspects of orchestration, with the relationship between all three roles also transformed. Critically, the introduction of a telemetry system seems to have had the potential to re-connect riders/performers back to operators/orchestrators and spectators/audience, re-introducing a closer relationship that used to be available with smaller rides. Introducing telemetry to a real-world situation also creates significant complexity, which we illustrate by focussing on a moment of perceived crisis.",
        "session": "SESSION: On the Move"
    },
    {
        "title": "Understanding geocaching practices and motivations",
        "authors": "Kenton O'Hara",
        "abstract": "Geocaching is a location-based activity that has been practiced for a number of years. As a sustained and established activity it represents an important opportunity for understanding everyday practices and motivations that can build up around a location-based activity. We present findings from a field study of everyday geocaching behaviour. In contrast to previous work, we take a broad perspective on the activity focussing beyond the in situ consumption of these experiences. We look too at the practices and motivations surrounding participants' creation of these experiences. Further we examine these behaviours within the social context of the on-line community that provides a significant basis for many of these behaviours. We use the findings to discuss broader implications for the design of future location-based experiences",
        "session": "SESSION: On the Move"
    },
    {
        "title": "Large scale analysis of web revisitation patterns",
        "authors": "Eytan Adar, Jaime Teevan, Susan T. Dumais",
        "abstract": "",
        "session": "SESSION: Web Visits in the Long"
    },
    {
        "title": "SearchBar: a search-centric web history for task resumption and information re-finding",
        "authors": "Dan Morris, Meredith Ringel Morris, Gina Venolia",
        "abstract": "",
        "session": "SESSION: Web Visits in the Long"
    },
    {
        "title": "Exploring multi-session web tasks",
        "authors": "Bonnie Ma Kay, Carolyn Watters",
        "abstract": "",
        "session": "Current user interfaces for Web search, including browsers and search engine sites, typically treat search as a transient activity. However, people often conduct complex, multi-query investigations that may span long durations and may be interrupted ...\n          Current user interfaces for Web search, including browsers and search engine sites, typically treat search as a transient activity. However, people often conduct complex, multi-query investigations that may span long durations and may be interrupted by other tasks. In this paper, we first present the results of a survey of users' search habits, which show that many search tasks span long periods of time. We then introduce SearchBar, a system for proactively and persistently storing query histories, browsing histories, and users' notes and ratings in an interrelated fashion. SearchBar supports multi-session investigations by assisting with task context resumption and information re-finding. We describe a user study comparing use of SearchBar to status-quo tools such as browser histories, and discuss our findings, which show that users find SearchBar valuable for task reacquisition. Our study also reveals the strategies employed by users of status-quo tools for handling multi-query, multi-session search tasks. expand"
    },
    {
        "title": "An exploratory study of visual information analysis",
        "authors": "Petra Isenberg, Anthony Tang, Sheelagh Carpendale",
        "abstract": "To design information visualization tools for collaborative use, we need to understand how teams engage with visualizations during their information analysis process. We report on an exploratory study of individuals, pairs, and triples engaged in information analysis tasks using paper-based visualizations. From our study results, we derive a framework that captures the analysis activities of co-located teams and individuals. Comparing this framework with existing models of the information analysis process suggests that information visualization tools may benefit from providing a flexible temporal flow of analysis actions.",
        "session": "SESSION: Visualization to Support Information Work"
    },
    {
        "title": "Do visualizations improve synchronous remote collaboration?",
        "authors": "Aruna D. Balakrishnan, Susan R. Fussell, Sara Kiesler",
        "abstract": "Information visualizations can improve collaborative problem solving, but this improvement may depend on whether visualizations promote communication. In an experiment on the effect of network visualizations, remote pairs worked synchronously to identify a serial killer. They discussed disparate evidence distributed across the pair using IM. Four conditions, respectively, offered (a) spreadsheet only (controls), (b) individual unshared visualizations, (c) view-only shared visualizations, and (d) a full-access shared visualization of all evidence. We examined collaborative performance, use of the visualization tool, and communication as a function of condition. All visualization conditions improved remote collaborators' performance over the control condition. Full access to a shared visualization best facilitated remote collaboration by encouraging tool use and fostering discussion between the partners. Shared visualization without full access impaired performance somewhat and made communication even more vital to identifying the serial killer. This study provides direct evidence of visualization tool features and partner behavior that promote collaboration.",
        "session": "SESSION: Visualization to Support Information Work"
    },
    {
        "title": "Supporting the analytical reasoning process in information visualization",
        "authors": "Yedendra Babu Shrinivasan, Jarke J. van Wijk",
        "abstract": "This paper presents a new information visualization framework that supports the analytical reasoning process. It consists of three views - a data view, a knowledge view and a navigation view. The data view offers interactive information visualization tools. The knowledge view enables the analyst to record analysis artifacts such as findings, hypotheses and so on. The navigation view provides an overview of the exploration process by capturing the visualization states automatically. An analysis artifact recorded in the knowledge view can be linked to a visualization state in the navigation view. The analyst can revisit a visualization state from both the navigation and knowledge views to review the analysis and reuse it to look for alternate views. The whole analysis process can be saved along with the synthesized information. We present a user study and discuss the perceived usefulness of a prototype based on this framework that we have developed.",
        "session": "SESSION: Visualization to Support Information Work"
    },
    {
        "title": "Impact of screen size on performance, awareness, and user satisfaction with adaptive graphical user interfaces",
        "authors": "Leah Findlater, Joanna McGrenere",
        "abstract": "Adaptive personalization, where the system adapts the interface to a user's needs, has the potential for significant performance benefits on small screen devices. However, research on adaptive interfaces has almost exclusively focused on desktop displays. To explore how well previous findings generalize to small screen devices, we conducted a study with 36 subjects to compare adaptive interfaces for small and desktop-sized screens. Results show that high accuracy adaptive menus have an even larger positive impact on performance and satisfaction when screen real estate is constrained. The drawback of the high accuracy menus, however, is that they reduce the user's awareness of the full set of items in the interface, potentially making it more difficult for users to learn about new features.",
        "session": "SESSION: Adaptation"
    },
    {
        "title": "Improving the performance of motor-impaired users with automatically-generated, ability-based interfaces",
        "authors": "Krzysztof Z. Gajos, Jacob O. Wobbrock, Daniel S. Weld",
        "abstract": "We evaluate two systems for automatically generating personalized interfaces adapted to the individual motor capabilities of users with motor impairments. The first system, SUPPLE, adapts to users' capabilities indirectly by first using the ARNAULD preference elicitation engine to model a user's preferences regarding how he or she likes the interfaces to be created. The second system, SUPPLE++, models a user's motor abilities directly from a set of one-time motor performance tests. In a study comparing these approaches to baseline interfaces, participants with motor impairments were 26.4% faster using ability-based user interfaces generated by SUPPLE++. They also made 73% fewer errors, strongly preferred those interfaces to the manufacturers' defaults, and found them more efficient, easier to use, and much less physically tiring. These findings indicate that rather than requiring some users with motor impairments to adapt themselves to software using separate assistive technologies, software can now adapt itself to the capabilities of its users.",
        "session": "SESSION: Adaptation"
    },
    {
        "title": "Evaluation of a role-based approach for customizing a complex development environment",
        "authors": "Leah Findlater, Joanna McGrenere, David Modjeska",
        "abstract": "Coarse-grained approaches to customization allow the user to enable or disable groups of features at once, rather than individual features. While this may reduce the complexity of customization and encourage more users to customize, the research challenges of designing such approaches have not been fully explored. To address this limitation, we conducted an interview study with 14 professional software developers who use an integrated development environment that provides a role-based, coarse-grained approach to customization. We identify challenges of designing coarse-grained customization models, including issues of functionality partitioning, presentation, and individual differences. These findings highlight potentially critical design choices, and provide direction for future work.",
        "session": "SESSION: Adaptation"
    },
    {
        "title": "Predictability and accuracy in adaptive user interfaces",
        "authors": "Krzysztof Z. Gajos, Katherine Everitt, Desney S. Tan, Mary Czerwinski, Daniel S. Weld",
        "abstract": "While proponents of adaptive user interfaces tout potential performance gains, critics argue that adaptation's unpredictability may disorient users, causing more harm than good. We present a study that examines the relative effects of predictability and accuracy on the usability of adaptive UIs. Our results show that increasing predictability and accuracy led to strongly improved satisfaction. Increasing accuracy also resulted in improved performance and higher utilization of the adaptive interface. Contrary to our expectations, improvement in accuracy had a stronger effect on performance, utilization and some satisfaction ratings than the improvement in predictability.",
        "session": "SESSION: Adaptation"
    },
    {
        "title": "Indirect mappings of multi-touch input using one and two hands",
        "authors": "Tomer Moscovich, John F. Hughes",
        "abstract": "Touchpad and touchscreen interaction using multiple fingers is emerging as a valuable form of high-degree-of-freedom input. While bimanual interaction has been extensively studied, touchpad interaction using multiple fingers of the same hand is not yet well understood. We describe two experiments on user perception and control of multi-touch interaction using one and two hands. The first experiment addresses how to maintain perceptual-motor compatibility in multi-touch interaction, while the second measures the separability of control of degrees-of-freedom in the hands and fingers. Results indicate that two-touch interaction using two hands is compatible with control of two points, while twotouch interaction using one hand is compatible with control of a position, orientation, and hand-span. A slight advantage is found for two hands in separating the control of two positions.",
        "session": "SESSION: Multitouch and Surface Computing"
    },
    {
        "title": "It's Mine, Don't Touch!: interactions at a large multi-touch display in a city centre",
        "authors": "Peter Peltonen, Esko Kurvinen, Antti Salovaara, Giulio Jacucci, Tommi Ilmonen, John Evans, Antti Oulasvirta, Petri Saarikko",
        "abstract": "We present data from detailed observations of CityWall, a large multi-touch display installed in a central location in Helsinki, Finland. During eight days of installation, 1199 persons interacted with the system in various social configurations. Videos of these encounters were examined qualitatively as well as quantitatively based on human coding of events. The data convey phenomena that arise uniquely in public use: crowding, massively parallel interaction, teamwork, games, negotiations of transitions and handovers, conflict management, gestures and overt remarks to co-present people, and \"marking\" the display for others. We analyze how public availability is achieved through social learning and negotiation, why interaction becomes performative and, finally, how the display restructures the public space. The multi-touch feature, gesture-based interaction, and the physical display size contributed differentially to these uses. Our findings on the social organization of the use of public displays can be useful for designing such systems for urban environments.",
        "session": "SESSION: Multitouch and Surface Computing"
    },
    {
        "title": "PressureFish: a method to improve control of discrete pressure-based input",
        "authors": "Kang Shi, Pourang Irani, Sean Gustafson, Sriram Subramanian",
        "abstract": "Studies investigating user control of pressure input have reported time-accuracy trade-offs of, on average, over 30%, when interacting with a large number of pressure levels. To increase the level of control with pressure input, we designed and evaluated four different discretization functions: linear, fisheye, visual fisheye, and clustered. The fisheye discretization dynamically modifies the range of pressure values based on the position of the pressure cursor. Our results show that a fisheye function results in significantly lower error rates and a lower number of crossings than have been reported in the literature. Furthermore, the fisheye function improves control without compromising speed. We discuss the findings of our study and identify several design recommendations for integrating pressure control into common interface tasks.",
        "session": "SESSION: Multitouch and Surface Computing"
    },
    {
        "title": "Stane: synthesized surfaces for tactile input",
        "authors": "Roderick Murray-Smith, John Williamson, Stephen Hughes, Torben Quaade",
        "abstract": "Stane is a hand-held interaction device controlled by tactile input: scratching or rubbing textured surfaces and tapping. The system has a range of sensors, including contact microphones, capacitive sensing and inertial sensing, and provides audio and vibrotactile feedback. The surface textures vary around the device, providing perceivably different textures to the user. We demonstrate that the vibration signals generated by stroking and scratching these surfaces can be reliably classified, and can be used as a very cheaply manufacturable way to control different aspects of interaction. The system is demonstrated as a control for a music player.",
        "session": "SESSION: Multitouch and Surface Computing"
    },
    {
        "title": "Activity-based prototyping of ubicomp applications for long-lived, everyday human activities",
        "authors": "Yang Li, James A. Landay",
        "abstract": "",
        "session": "SESSION: Activity-Based Prototyping and Software"
    },
    {
        "title": "Employing patterns and layers for early-stage design and prototyping of cross-device user interfaces",
        "authors": "James Lin, James A. Landay",
        "abstract": "",
        "session": "SESSION: Activity-Based Prototyping and Software"
    },
    {
        "title": "Using information scent to model the dynamic foraging behavior of programmers in maintenance tasks",
        "authors": "Joseph Lawrance, Rachel Bellamy, Margaret Burnett, Kyle Rector",
        "abstract": "",
        "session": "SESSION: Activity-Based Prototyping and Software"
    },
    {
        "title": "Melange: space folding for multi-focus interaction",
        "authors": "Niklas Elmqvist, Nathalie Henry, Yann Riche, Jean-Daniel Fekete",
        "abstract": "Interaction and navigation in large geometric spaces typically require a sequence of pan and zoom actions. This strategy is often ineffective and cumbersome, especially when trying to study several distant objects. We propose a new distortion technique that folds the intervening space to guarantee visibility of multiple focus regions. The folds themselves show contextual information and support unfolding and paging interactions. Compared to previous work, our method provides more context and distance awareness. We conducted a study comparing the space-folding technique to existing approaches, and found that participants performed significantly better with the new technique.",
        "session": "SESSION: Multidimensional Visualization"
    },
    {
        "title": "Sigma lenses: focus-context transitions combining space, time and translucence",
        "authors": "Emmanuel Pietriga, Caroline Appert",
        "abstract": "Focus + context techniques such as fisheye lenses are used to navigate and manipulate objects in multi-scale worlds. They provide in-place magnification of a region without requiring users to zoom the whole representation and consequently lose context. Their adoption is however hindered by usability problems mostly due to the nature of the transition between focus and context. Existing transitions are often based on a physical metaphor (magnifying glass, fisheye, rubber sheet), and are almost always achieved through a single dimension: space. We investigate how other dimensions, namely time and translucence, can be used to achieve more efficient transitions. We present an extension to Carpendale's framework for unifying presentation space accommodating these new dimensions. We define new lenses in that space, called Sigma lenses, and compare them to existing lenses through experiments based on a generic task: focus targeting. Results show that one new lens, the Speed-coupled flattening lens, significantly outperforms all others.",
        "session": "SESSION: Multidimensional Visualization"
    },
    {
        "title": "FacetZoom: a continuous multi-scale widget for navigating hierarchical metadata",
        "authors": "Raimund Dachselt, Mathias Frisch, Markus Weiland",
        "abstract": "Faceted browsing is a promising way to incrementally refine data sets. Current approaches do not scale well in terms of screen size and have shortcomings in interacting with hierarchical facets. This paper introduces FacetZoom, a novel multi-scale widget combining facet browsing with zoomable user interfaces. Hierarchical facets are displayed as space-filling widgets which allow a fast traversal across all levels while simultaneously maintaining context. We contribute both a seamless continuous navigation and a quick tap-and-center interaction. Two prototypes are described which successfully apply the space-structuring widget to continuous, sampled data and an information collection. A formative user study of the latter indicates that the interface scales well to small screens. FacetZoom is versatile and offers consistent searching and browsing behaviors in a multitude of applications and device settings.",
        "session": "SESSION: Multidimensional Visualization"
    },
    {
        "title": "LivOlay: interactive ad-hoc registration and overlapping of applications for collaborative visual exploration",
        "authors": "Hao Jiang, Daniel Wigdor, Clifton Forlines, Michelle Borkin, Jens Kauffmann, Chia Shen",
        "abstract": "The interoperability of disparate data types and sources has been a long standing problem and a hindering factor for the efficacy and efficiency in visual exploration applications. In this paper, we present a solution, called LivOlay, that enables the rapid visual overlay of live data rendered in different applications. Our tool addresses datasets in which visual registration of the information is necessary in order to allow for thorough understanding and visual analysis. We also discuss initial evaluation and user feedback of LivOlay.",
        "session": "SESSION: Multidimensional Visualization"
    },
    {
        "title": "PieCursor: merging pointing and command selection for rapid in-place tool switching",
        "authors": "George Fitzmaurice, Justin Matejka, Azam Khan, Michael Glueck, Gordon Kurtenbach",
        "abstract": "We describe a new type of graphical user interface widget called the \"PieCursor.\" The PieCursor is based on the Tracking Menu technique and consists of a radial cluster of command wedges, is roughly the size of a cursor, and replaces the traditional cursor. The PieCursor technique merges the normal cursor function of pointing with command selection into a single action. A controlled experiment was conducted to compare the performance of rapid command and target selection using the PieCursor against larger versions of Tracking Menus and a status quo Toolbar configuration. Results indicate that for small clusters of tools (4 and 8 command wedges) the PieCursor can outperform the toolbar by 20.8% for coarse pointing. For fine pointing, the performance of the PieCursor degrades approximately to the performance found for the Toolbar condition.",
        "session": "SESSION: Menu and Command Selection"
    },
    {
        "title": "Tilt menu: using the 3D orientation information of pen devices to extend the selection capability of pen-based user interfaces",
        "authors": "Feng Tian, Lishuang Xu, Hongan Wang, Xiaolong Zhang, Yuanyuan Liu, Vidya Setlur, Guozhong Dai",
        "abstract": "We present a new technique called 'Tilt Menu' for better extending selection capabilities of pen-based interfaces. The Tilt Menu is implemented by using 3D orientation information of pen devices while performing selection tasks. The Tilt Menu has the potential to aid traditional one-handed techniques as it simultaneously generates the secondary input (e.g., a command or parameter selection) while drawing/interacting with a pen tip without having to use the second hand or another device. We conduct two experiments to explore the performance of the Tilt Menu. In the first experiment, we analyze the effect of parameters of the Tilt Menu, such as the menu size and orientation of the item, on its usability. Results of the first experiment suggest some design guidelines for the Tilt Menu. In the second experiment, the Tilt Menu is compared to two types of techniques while performing connect-the-dot tasks using freeform drawing mechanism. Results of the second experiment show that the Tilt Menu perform better in comparison to the Tool Palette, and is as good as the Toolglass.",
        "session": "SESSION: Menu and Command Selection"
    },
    {
        "title": "AAMU: adaptive activation area menus for improving selection in cascading pull-down menus",
        "authors": "Erum Tanvir, Jonathan Cullen, Pourang Irani, Andy Cockburn",
        "abstract": "Selecting items in cascading pull-down menus is a frequent task in most GUIs. These selections involve two major components: steering and selection, with the steering component being the most time-consuming and error-prone. We describe a new technique, called Adaptive Activation-Area Menu (AAMU) that eliminate corner steering. AAMUs contain an enlarged activation area which dynamically resizes itself providing a broader steering path for menu navigation. We also combined AAMUs with Force-field menus, to create Force-AAMUs. We empirically demonstrate that AAMUs and Force-AAMUs outperformed the current default menu. We also compared performances of various other menus including Enlarged activation area menus (EMUs) and Gesture based selection with mouse as an input device. Overall, users show higher satisfaction rates for AAMUs over other menu designs.",
        "session": "SESSION: Menu and Command Selection"
    },
    {
        "title": "Genetic algorithm can optimize hierarchical menus",
        "authors": "Shouichi Matsui, Seiji Yamada",
        "abstract": "Hierarchical menus are now ubiquitous. The performance of the menu depends on many factors: structure, layout, colors and so on. There has been extensive research on novel menus, but there has been little work on improving the performance by optimizing the menu's structure. This paper proposes an algorithm based on the genetic algorithm (GA) for optimizing the performance of menus. The algorithm aims to minimize the average selection time of menu items by considering movement and decision time. We show results on a static hierarchical menu of a cellular phone where a small screen and limited input device are assumed. Our work makes several contributions: a novel mathematical optimization model for hierarchical menus; novel optimization method based on the genetic algorithm (GA).",
        "session": "SESSION: Menu and Command Selection"
    },
    {
        "title": "Blindsight: eyes-free access to mobile phones",
        "authors": "Kevin A. Li, Patrick Baudisch, Ken Hinckley",
        "abstract": "Many mobile phones integrate services such as personal calendars. Given the social nature of the stored data, however, users often need to access such information as part of a phone conversation. In typical non-headset use, this re-quires users to interrupt their conversations to look at the screen. We investigate a counter-intuitive solution: to avoid the need for interruption we replace the visual interface with one based on auditory feedback. Surprisingly, this can be done without interfering with the phone conversation. We present blindSight, a prototype application that replaces the traditionally visual in-call menu of a mobile phone. Users interact using the phone keypad, without looking at the screen. BlindSight responds with auditory feedback. This feedback is heard only by the user, not by the person on the other end of the line. We present the results of two user studies of our prototype. The first study verifies that useful keypress accuracy can be obtained for the phone-at-ear position. The second study compares the blindSight system against a visual baseline condition and finds a preference for blindSight.",
        "session": "SESSION: Model Interaction"
    },
    {
        "title": "One-handed touchscreen input for legacy applications",
        "authors": "Amy K. Karlson, Benjamin B. Bederson",
        "abstract": "Supporting one-handed thumb operation of touchscreen-based mobile devices presents a challenging tradeoff between visual expressivity and ease of interaction. ThumbSpace and Shift---two new application-independent, software-based interaction techniques---address this tradeoff in significantly different ways. ThumbSpace addresses distant objects while Shift addresses small object occlusion. We present two extensive, comparative user studies. The first compares ThumbSpace and Shift to peripheral hardware (directional pad and scrollwheel) and direct touchscreen input for selecting objects while standing and walking. The data favored the Shift design overall, but suggested ThumbSpace is promising for distant objects. Our second study examines the benefits and learnability of combining Shift and ThumbSpace on a device with a larger screen (3.5\"). We found their combined use offered users better overall speed and accuracy in hitting small targets (3.6 mm2) than using either method alone.",
        "session": "SESSION: Model Interaction"
    },
    {
        "title": "Target acquisition with camera phones when used as magic lenses",
        "authors": "Michael Rohs, Antti Oulasvirta",
        "abstract": "When camera phones are used as magic lenses in handheld augmented reality applications involving wall maps or posters, pointing can be divided into two phases: (1) an initial coarse physical pointing phase, in which the target can be directly observed on the background surface, and (2) a fine-control virtual pointing phase, in which the target can only be observed through the device display. In two studies, we show that performance cannot be adequately modeled with standard Fitts' law, but can be adequately modeled with a two-component modification. We chart the performance space and analyze users' target acquisition strategies in varying conditions. Moreover, we show that the standard Fitts' law model does hold for dynamic peephole pointing where there is no guiding background surface and hence the physical pointing component of the extended model is not needed. Finally, implications for the design of magic lens interfaces are considered.",
        "session": "SESSION: Model Interaction"
    },
    {
        "title": "Sonic interventions: understanding and extending the domestic soundscape",
        "authors": "Gerard Oleksik, David Frohlich, Lorna M. Brown, Abigail Sellen",
        "abstract": "This paper presents a new study of the role, importance and meaning of sound in the home. Drawing on interview data and sound recordings gathered from seven households, this study offers fresh insight into the ways in which the domestic soundscape is managed and understood. The data revealed that household members engaged in a wide variety of sound management practices to monitor and control the real-time flow of sonic information throughout the home. They also showed that families were sometimes surprised and delighted by the ability to record fragments of the soundscape for later use. These findings suggest a number of roles for technology in enhancing the domestic soundscape and its associated behaviors, which we present here in the form of example sonic interventions created in a design workshop at the end of the project.",
        "session": "SESSION: Domesticity and Design"
    },
    {
        "title": "Threshold devices: looking out from the home",
        "authors": "William Gaver, Andy Boucher, Andy Law, Sarah Pennington, John Bowers, Jacob Beaver, Jan Humble, Tobie Kerridge, Nicholas Villar, Alex Wilkie",
        "abstract": "Threshold devices present information gathered from the home's surroundings to give new views on the domestic situation. We built two prototypes of different threshold devices and studied them in field trials with participant households. The Local Barometer displays online text and images related to the home's locality depending on the local wind conditions to give an impression of the sociocultural surroundings. The Plane Tracker tracks aircraft passing overhead and imagines their flights onscreen to resource an understanding of the home's global links. Our studies indicated that the experiences they provided were compelling, that participants could and did interpret the devices in various ways, that their form designs were appropriate for domestic environments, that using ready-made information contributed to the richness of the experiences, and that situating the information they provided with respect to the home and its locality was important for the ways people engaged with them.",
        "session": "SESSION: Domesticity and Design"
    },
    {
        "title": "Requirements engineering for home care technology",
        "authors": "Marilyn Rose McGee-Lennon",
        "abstract": "The focus of this work is the requirements engineering process in the home care domain. The overall aim is to design and document a flexible methodology to facilitate the elicitation of complex, dynamic, multi-stakeholder requirements and needs. This paper details the complexity and uniqueness of the home care domain and outlines the features of home care that demand a new or tailored approach to requirements engineering. It concludes by presenting a consolidated list of features that must be available or supported in requirements engineering methods in the home care domain.",
        "session": "SESSION: Domesticity and Design"
    },
    {
        "title": "Game over: learning by dying",
        "authors": "Dimitris Grammenos",
        "abstract": "This paper presents the design and evaluation of \"Game Over!\", which is the world's first universally inaccessible game (i.e., a game that can be played by no one). The game is meant to be used as an educational tool for disseminating and teaching game accessibility guidelines. This is achieved by providing game developers a first-hand (frustrating) experience of how it feels interacting with a game that is not accessible, due to the fact that important design rules were not considered or applied during its design. Both the overall concept and the approach followed were evaluated and validated through: (a) an on-line survey; (b) \"live\" feedback from players and developers; and (c) public opinions and critique collected from numerous Web sites and blogs where \"Game Over!\" was presented and discussed. The evaluation outcomes strongly suggest that computer games and humor constitute a perfect match for reaching out, motivating and educating the game developers' community in the subject of game accessibility.",
        "session": "SESSION: Game Zone"
    },
    {
        "title": "Heuristic evaluation for games: usability principles for video game design",
        "authors": "David Pinelle, Nelson Wong, Tadeusz Stach",
        "abstract": "Most video games require constant interaction, so game designers must pay careful attention to usability issues. However, there are few formal methods for evaluating the usability of game interfaces. In this paper, we introduce a new set of heuristics that can be used to carry out usability inspections of video games. The heuristics were developed to help identify usability problems in both early and functional game prototypes. We developed the heuristics by analyzing PC game reviews from a popular gaming website, and the review set covered 108 different games and included 18 from each of 6 major game genres. We analyzed the reviews and identified twelve common classes of usability problems seen in games. We developed ten usability heuristics based on the problem categories, and they describe how common game usability problems can be avoided. A preliminary evaluation of the heuristics suggests that they help identify game-specific usability problems that can easily be overlooked otherwise.",
        "session": "SESSION: Game Zone"
    },
    {
        "title": "Renegade gaming: practices surrounding social use of the Nintendo DS handheld gaming system",
        "authors": "Christine Szentgyorgyi, Michael Terry, Edward Lank",
        "abstract": "Today's handheld gaming systems allow players to engage in multiplayer games via ad-hoc, wireless networking. They are also now sufficiently commonplace that it is possible to study how portability and ad-hoc wireless networking have affected the social gaming practices of owners of these systems. In this paper, we report findings from a qualitative study investigating the collocated multiplayer gaming practices of Nintendo DS owners. Based on interviews of nine DS owners and observations of three organized gaming events, we identified three major themes surrounding the social, multiplayer gaming practices of Nintendo DS users: renegade gaming, or the notion that users reappropriate contexts traditionally hostile to game play; pragmatic and social barriers to the formation of ad-hoc pick-up games, despite a clear desire for multiplayer, collocated gaming; and private gaming spheres, or the observation that the handheld device's form factor creates individual, privatized gaming contexts within larger social contexts. These findings lead to a set of implications for the design of future handheld gaming systems.",
        "session": "SESSION: Game Zone"
    },
    {
        "title": "Expandable grids for visualizing and authoring computer security policies",
        "authors": "Robert W. Reeder, Lujo Bauer, Lorrie Faith Cranor, Michael K. Reiter, Kelli Bacon, Keisha How, Heather Strong",
        "abstract": "We introduce the Expandable Grid, a novel interaction technique for creating, editing, and viewing many types of security policies. Security policies, such as file permissions policies, have traditionally been displayed and edited in user interfaces based on a list of rules, each of which can only be viewed or edited in isolation. These list-of-rules interfaces cause problems for users when multiple rules interact, because the interfaces have no means of conveying the interactions amongst rules to users. Instead, users are left to figure out these rule interactions themselves. An Expandable Grid is an interactive matrix visualization designed to address the problems that list-of-rules interfaces have in conveying policies to users. This paper describes the Expandable Grid concept, shows a system using an Expandable Grid for setting file permissions in the Microsoft Windows XP operating system, and gives results of a user study involving 36 participants in which the Expandable Grid approach vastly outperformed the native Windows XP file-permissions interface on a broad range of policy-authoring tasks.",
        "session": "SESSION: Visualizations"
    },
    {
        "title": "LiveRAC: interactive visual exploration of system management time-series data",
        "authors": "Peter McLachlan, Tamara Munzner, Eleftherios Koutsofios, Stephen North",
        "abstract": "We present LiveRAC, a visualization system that supports the analysis of large collections of system management time-series data consisting of hundreds of parameters across thousands of network devices. LiveRAC provides high information density using a reorderable matrix of charts, with semantic zooming adapting each chart's visual representation to the available space. LiveRAC allows side-by-side visual comparison of arbitrary groupings of devices and parameters at multiple levels of detail. A staged design and development process culminated in the deployment of LiveRAC in a production environment. We conducted an informal longitudinal evaluation of LiveRAC to better understand which proposed visualization techniques were most useful in the target environment.",
        "session": "SESSION: Visualizations"
    },
    {
        "title": "Metrics for measuring human interaction with interactive visualizations for information analysis",
        "authors": "Theresa A. O'Connell,, Yee-Yin Choong",
        "abstract": "There is a lack of widely-accepted metrics for evaluating analysts' experiences with interactive visualizations (IV) for information analysis. We report an approach for developing analyst-centered IV metrics that is built upon understanding the workplace needs and experiences of information analysts with respect to IVs. We derive metrics from human-computer interaction heuristics, specializing the metrics to address the characteristics of IVs and analysts. When there are no existing heuristics, analysts' needs and experiences inform new heuristics.",
        "session": "SESSION: Visualizations"
    },
    {
        "title": "On the benefits of confidence visualization in speech recognition",
        "authors": "Keith Vertanen, Per Ola Kristensson",
        "abstract": "In a typical speech dictation interface, the recognizer's best-guess is displayed as normal, unannotated text. This ignores potentially useful information about the recognizer's confidence in its recognition hypothesis. Using a confidence measure (which itself may sometimes be inaccurate), we investigated providing visual feedback about low-confidence portions of the recognition using shaded, red underlining. An evaluation showed, compared to a baseline without underlining, underlining low-confidence areas did not increase user's speed or accuracy in detecting errors. However, we found that when recognition errors were correctly underlined, they were discovered significantly more often than baseline. Conversely, when errors failed to be underlined, they were discovered less often. Our results indicate confidence visualization can be effective --- but only if the confidence measure has high accuracy. Further, since our results show that users tend to trust confidence visualization, designers should be careful in its application if a high accuracy confidence measure is not available.",
        "session": "SESSION: Visualizations"
    },
    {
        "title": "A latent semantic analysis methodology for the identification and creation of personas",
        "authors": "Tomasz Miaskiewicz, Tamara Sumner, Kenneth A. Kozar",
        "abstract": "A persona represents a group of target users that share common behavioral characteristics. By using a narrative, picture, and name, a persona provides HCI practitioners with a vivid and specific design target. This research develops a new methodology for the identification and creation of personas through the application of Latent Semantic Analysis (LSA). An application of the LSA methodology is provided in the context of the design of an Institutional Repository system. The LSA methodology helps overcome some of the drawbacks of current methods for the identification and creation of personas, and makes the process less subjective, more efficient, and less reliant on specialized skills.",
        "session": "SESSION: Character Development"
    },
    {
        "title": "The effects of empathetic virtual characters on presence in narrative-centered learning environments",
        "authors": "Scott W. McQuiggan, Jonathan P. Rowe, James C. Lester",
        "abstract": "Recent years have seen a growing interest in the role that narrative can play in learning. With the emergence of narrative-centered learning environments that engage students by drawing them into rich interactions with compelling characters, we have begun to see the significant potential offered by immersive story-based learning experiences. In this paper we describe two studies that investigate the impact of empathetic characters on student perceptions of presence. A study was initially conducted with middle school students, and was then replicated with high school students. The results indicate that, for both populations, employing empathetic characters in narrative-centered learning environments significantly increases student perceptions of presence. The studies also reveal that empathetic characters contribute to a heightened sense of student involvement and control in learning situations.",
        "session": "SESSION: Character Development"
    },
    {
        "title": "Data-driven persona development",
        "authors": "Jennifer (Jen) McGinn, Nalini Kotamraju",
        "abstract": "Much has been written on creating personas --- both what they are good for, and how to create them. A common problem with personas is that they are not based on real customer data, and if they are, the data set is not of a sample size that can be considered statistically significant. In this paper, we describe a new method for creating and validating personas, based on the statistical analysis of data, which is fast and cost effective.",
        "session": "SESSION: Character Development"
    },
    {
        "title": "Cross-channel mobile social software: an empirical study",
        "authors": "Clint Heyer, Margot Brereton, Stephen Viller",
        "abstract": "In this paper, we introduce a prototype system designed to support mobile group socializing that has been appropriated for everyday use by 150 users over 18 months. The system supports cross-channel communication, allowing users to participate in group conversations using text messaging, instant messaging, email and the web. It does this with the \"console,\" a uniform text-based syntax that enables the prototype to be used over a variety of mediums. We found that participants used the system mostly for ad-hoc coordination rather than chat, with pervasive, cross-channel group communication supporting an informal \"half-invite\" style of invitation. We examine why coordination dominates over chat, suggesting that cross-channel mobile group messaging serves a distinct role, different to traditional text messaging, instant messaging and email. Furthermore, we found differences in the content and usage habits across channels, for example messages sent from a computer were more likely to refer to time and location than those sent using a phone. We also discuss the usage of the prototype and compare it to other work.",
        "session": "SESSION: Social Presence"
    },
    {
        "title": "Social copresence in anonymous social interactions using a mobile video telephone",
        "authors": "Sin-Hwa Kang, James H. Watt, Sasi Kanth Ala",
        "abstract": "In this paper, we describe research exploring the effect of behavioral and visual realism of avatars on users' social copresence in emotionally engaged conversations conducted via a simulated mobile video telephone. We offer an elaborated definition of Social Copresence to better measure users' engagement with conversational partners in social interactions that do not involve specific tasks or concrete outcomes. We investigate ways to secure mobile telephone users' anonymity while preserving their most important nonverbal affective behaviors. Experimental results with 180 participants using different combinations of static and dynamic, high and low iconic (both video and graphically animated) avatars show increased Social Copresence with dynamic high-iconic (similar to the human communicator) avatars incorporating correct facial expressions, even when these are presented on the small screen of mobile telephones in such a way that individual identities are masked. The results point to an economical combination of behavioral and iconic realism of avatars that produces maximum emotional engagement in anonymous social interactions using mobile video telephones.",
        "session": "SESSION: Social Presence"
    },
    {
        "title": "Use and reuse of shared lists as a social content type",
        "authors": "Werner Geyer, Casey Dugan, Joan DiMicco, David R. Millen, Beth Brownholtz, Michael Muller",
        "abstract": "Social networking sites support a variety of shared content types such as photos, videos, or music. More structured or form-based social content types are not mainstream but we have started seeing sites evolve that support them. This paper describes the design and use of structured lists in an enterprise social networking system. As a major feature of our shared lists, we introduced the ability to reuse someone else's list. We report the results on the use and reuse of shared lists based on three months of usage data from 285 users and interviews with 9 users. Our findings suggest that despite the structured nature of lists, our users socialize more around lists than photos, and use lists as a medium for self-representation.",
        "session": "SESSION: Social Presence"
    },
    {
        "title": "Emotional and behavioral responses to haptic stimulation",
        "authors": "Katri Salminen, Veikko Surakka, Jani Lylykangas, Jukka Raisamo, Rami Saarinen, Roope Raisamo, Jussi Rantala, Grigori Evreinov",
        "abstract": "A prototype of friction-based horizontally rotating fingertip stimulator was used to investigate emotional experiences and behavioral responses to haptic stimulation. The rotation style of 12 different stimuli was varied by burst length (i.e., 20, 50, 100 ms), continuity (i.e., continuous and discontinuous), and direction (e.g., forward and backward). Using these stimuli 528 stimulus pairs were presented to 12 subjects who were to distinguish if stimuli in each pair were the same or different. Then they rated the stimuli using four scales measuring the pleasantness, arousal, approachability, and dominance qualities of the 12 stimuli. The results showed that continuous forward-backward rotating stimuli were rated as significantly more unpleasant, arousing, avoidable, and dominating than other types of stimulations (e.g., discontinuous forward rotation). The reaction times to these stimuli were significantly faster than reaction times to discontinuous forward and backward rotating stimuli. The results clearly suggest that even simple haptic stimulation can carry emotional information. The results can be utilized when making use of haptics in human-technology interaction.",
        "session": "SESSION: Tactile and Haptic User Interfaces"
    },
    {
        "title": "Evaluating tactile feedback and direct vs. indirect stylus input in pointing and crossing selection tasks",
        "authors": "Clifton Forlines, Ravin Balakrishnan",
        "abstract": "We present a pair of experiments that explore the effects of tactile-feedback and direct vs. indirect pen input on pointing and crossing selection tasks. While previous work has demonstrated the validity of crossing as a useful selection mechanism for pen-based computing, those experiments were conducted using an indirect input device -- one in which the pen-input and display were separated. We investigate users' performance with pointing and crossing interfaces controlled via not only an indirect input device, but also a direct input device -- one in which the pen-input and display are co-located. Results show that direct input significantly outperforms indirect input for crossing selection, but the two modalities are essentially equivalent in pointing selection. A small amount of tactile feedback is shown to be beneficial for both pointing and crossing selection, most noticeably in crossing tasks when using direct input where visual feedback is often occluded by a hand or stylus.",
        "session": "SESSION: Tactile and Haptic User Interfaces"
    },
    {
        "title": "Investigating the effectiveness of tactile feedback for mobile touchscreens",
        "authors": "Eve Hoggan, Stephen A. Brewster, Jody Johnston",
        "abstract": "This paper presents a study of finger-based text entry for mobile devices with touchscreens. Many devices are now coming to market that have no physical keyboards (the Apple iPhone being a very popular example). Touchscreen keyboards lack any tactile feedback and this may cause problems for entering text and phone numbers. We ran an experiment to compare devices with a physical keyboard, a standard touchscreen and a touchscreen with tactile feedback added. We tested this in both static and mobile environments. The results showed that the addition of tactile feedback to the touchscreen significantly improved finger-based text entry, bringing it close to the performance of a real physical keyboard. A second experiment showed that higher specification tactile actuators could improve performance even further. The results suggest that manufacturers should use tactile feedback in their touchscreen devices to regain some of the feeling lost when interacting on a touchscreen with a finger.",
        "session": "SESSION: Tactile and Haptic User Interfaces"
    },
    {
        "title": "A co-located interface for narration to support reconciliation in a conflict: initial results from Jewish and Palestinian youth",
        "authors": "Oliviero Stock, Massimo Zancanaro, Chaya Koren, Cesare Rocchi, Zvi Eisikovits, Dina Goren-bar, Daniel Tomasini, Patrice (Tamar) Weiss",
        "abstract": "So called intractable conflicts may benefit from more modest and socially oriented approaches than those based on classical conflict resolution techniques. This paper is inspired by theories on small group intervention in a conflict. The general claim is that participants may achieve a greater understanding of and appreciation for the other's viewpoint under conditions that support partaking in a tangible joint task and creating a shared narration. Our goal was to design a methodology wherein the extent to which technology contributes to conflict negotiation and resolution could be assessed. Specifically, a co-located interface for producing a joint narration as a tool for favouring reconciliation is presented and discussed. The results of an initial set of studies where the interface was used by Arab and Jewish youth in Israel provided insight into the usability of the various components of the technology and of the paradigm.",
        "session": "SESSION: Culture and Technology"
    },
    {
        "title": "Cultural theory and real world design: Dystopian and Utopian Outcomes",
        "authors": "Christine Satchell",
        "abstract": "When exploring a topic as intangible as the construction of mobile social networks it is necessary to look at how relationships are formed and at the way users identify themselves through their interactions. The theoretically informed discourses within cultural theory make an ideal lens for understanding these subtle nuances of use in terms of design. This paper describes a case study where the application of abstract cultural theory concepts to the practical act of analysing qualitative data from a user study resulted in the development of The Swarm mobile phone prototypes. By signposting the intersection of cultural theory within HCI, the value of a philosophically grounded mobile phone design space is highlighted. To uncover reactions to the design we explored the blogs that sprung up critiquing an online version of The Swarm and in doing so, discovered the at times subversive values (such as the need to lie) that users place on their mobile mediated interactions.",
        "session": "SESSION: Culture and Technology"
    },
    {
        "title": "The network in the garden: an empirical analysis of social media in rural life",
        "authors": "Eric Gilbert, Karrie Karahalios, Christian Sandvig",
        "abstract": "",
        "session": "SESSION: Culture and Technology"
    },
    {
        "title": "An error model for pointing based on Fitts' law",
        "authors": "Jacob O. Wobbrock, Edward Cutrell, Susumu Harada, I. Scott MacKenzie",
        "abstract": "For decades, Fitts' law (1954) has been used to model pointing time in user interfaces. As with any rapid motor act, faster pointing movements result in increased errors. But although prior work has examined accuracy as the \"spread of hits,\" no work has formulated a predictive model for error rates (0-100%) based on Fitts' law parameters. We show that Fitts' law mathematically implies a predictive error rate model, which we derive. We then describe an experiment in which target size, target distance, and movement time are manipulated. Our results show a strong model fit: a regression analysis of observed vs. predicted error rates yields a correlation of R2=.959 for N=90 points. Furthermore, we show that the effect on error rate of target size (W) is greater than that of target distance (A), indicating a departure from Fitts' law, which maintains that W and A contribute proportionally to index of difficulty (ID). Our error model can be used with Fitts' law to estimate and predict error rates along with speeds, providing a framework for unifying this dichotomy.",
        "session": "SESSION: Fitt's Law Lives"
    },
    {
        "title": "Optimal parameters for efficient crossing-based dialog boxes",
        "authors": "Morgan Dixon, François Guimbretière, Nicholas Chen",
        "abstract": "We present an empirical analysis of crossing-based dialog boxes. First, we study the spatial constraints required for efficient crossing-based interactions in the case of a simple multi-parameter dialog box. Through a series of 3 tasks, we establish the minimal value of the landing margin, the takeoff margin, and the column width. We also offer an estimation of the role of stroke shape on user performance. After studying the reasons for errors during our experiment, we propose a relaxed crossing semantic that combines aspects of pointing and crossing-based interfaces. To test our design, we compare a naïve dialog box implementation with our new implementation, as well as a standard point-and-click dialog box. Our results reveal that there is not a significant difference between the naïve crossing implementation and the standard point-and-click interface and that the new crossing semantic is faster than both the naïve crossing implementation and the point-and-click interface, despite a higher error rate. Together these two experiments establish that crossing-based dialog boxes can be as spatially efficient and faster than their point-and-click counterpart. Our new semantic provides the first step towards a smooth transition from point-and-click interfaces to crossing-based interfaces.",
        "session": "SESSION: Fitt's Law Lives"
    },
    {
        "title": "Fitts' throughput and the speed-accuracy tradeoff",
        "authors": "I. Scott MacKenzie, Poika Isokoski",
        "abstract": "We describe an experiment to test the hypothesis that Fitts' throughput is independent of the speed-accuracy tradeoff. Eighteen participants used a mouse in performing a total of 5,400 target selection trials. Comparing nominal, speed-emphasis, and accuracy-emphasis conditions, significant main effects were found on movement time (ms) and error rate (%), but not on throughput (bits/s). In the latter case, failure to reject the null hypothesis of \"no significant difference\" (i.e., .05 < p < 1) is viewed as evidence supporting the constant-throughput hypothesis.",
        "session": "SESSION: Fitt's Law Lives"
    },
    {
        "title": "Articulating common ground in cooperative work: content and process",
        "authors": "Gregorio Convertino, Helena M. Mentis, Mary Beth Rosson, John M. Carroll, Aleksandra Slavkovic, Craig H. Ganoe",
        "abstract": "We study the development of common ground in an emergency management planning task. Twelve three-person multi-role teams performed the task with a paper prototype in a controlled setting; each team completed three versions of the task. We use converging measures to document the development of common ground in the teams and present an in-depth analysis of the characteristics of the common ground development process. Our findings indicate that in complex collaborative work, process common ground increases, thus diminishing the need for acts like information querying or strategy discussions about how to organize the collaborative activities. However, content common ground is created and tested throughout the three runs; in fact dialogue acts used to clarify this content increase over time. Discussion of the implications of these findings for the theory of common ground and the design of collaborative systems follows.",
        "session": "SESSION: Collaboration and Cooperation"
    },
    {
        "title": "CoSearch: a system for co-located collaborative web search",
        "authors": "Saleema Amershi, Meredith Ringel Morris",
        "abstract": "Web search is often viewed as a solitary task; however, there are many situations in which groups of people gather around a single computer to jointly search for information online. We present the findings of interviews with teachers, librarians, and developing world researchers that provide details about users' collaborative search habits in shared-computer settings, revealing several limitations of this practice. We then introduce CoSearch, a system we developed to improve the experience of co-located collaborative Web search by leveraging readily available devices such as mobile phones and extra mice. Finally, we present an evaluation comparing CoSearch to status quo collaboration approaches, and show that CoSearch enabled distributed control and division of labor, thus reducing the frustrations associated with shared-computer searches, while still preserving the positive aspects of communication and collaboration associated with joint computer use.",
        "session": "SESSION: Collaboration and Cooperation"
    },
    {
        "title": "A survey of collaborative web search practices",
        "authors": "Meredith Ringel Morris",
        "abstract": "Today's Web browsers provide limited support for rich information-seeking and information-sharing scenarios. A survey we conducted of 204 knowledge workers at a large technology company has revealed that a large proportion of users engage in searches that include collaborative activities. We present the results of the survey, and then review the implications of these findings for designing new Web search interfaces that provide tools for sharing.",
        "session": "SESSION: Collaboration and Cooperation"
    },
    {
        "title": "OpenMessenger: gradual initiation of interaction for distributed workgroups",
        "authors": "Jeremy P. Birnholtz, Carl Gutwin, Gonzalo Ramos, Mark Watson",
        "abstract": "The initiation of interaction in face-to-face environments is a gradual process, and takes place in a rich information landscape of awareness, attention, and social signals. One of the main benefits of this process is that people can be more sensitive to issues of privacy and interruption while they are moving towards interaction. However, on-line communication tools do not provide this subtlety, and often lead to unwanted interruptions. We have developed a prototype message system called OpenMessenger (OM) that adds the idea of gradual initiation of interaction to on-line communication. OpenMessenger provides multiple levels of awareness about people, and provides notification to those about whom information is being gathered. OpenMessenger allows people to negotiate interaction in a richer fashion than is possible with any other current messaging system. Preliminary evaluation data suggest the utility of the approach, but also shows that there are a number of issues yet to be resolved in this area.",
        "session": "SESSION: Collaboration and Cooperation"
    },
    {
        "title": "How accurate must an in-car information system be?: consequences of accurate and inaccurate information in cars",
        "authors": "Ing-Marie Jonsson, Helen Harris, Clifford Nass",
        "abstract": "Driving requires focused attention and timely decision making for appropriate maneuvers. This relies on well-timed and accurate information. Designing an in-vehicle information system it is important to ensure that the information for the driver does not negatively affect cognitive processing and driving performance. This study investigates levels of information accuracy necessary in in-vehicle information systems to elicit positive behavioral and attitudinal responses from the driver. In a 2 (gender) by 5 (accuracy: 100%, 88%, 76%, 64% and no system) between-participants study, 100 participants drove in a driving simulator for 25 minutes with an in-vehicle information system designed to inform the driver of hazard and traffic events. Results show that decreasing the accuracy of the system decreased both driving performance and trust and liking of car and in-vehicle system. Female drivers in particular benefit from the in-vehicle system and show higher tolerance of inaccuracies. Design implications for in-vehicle systems are discussed.",
        "session": "SESSION: Driving in My Car"
    },
    {
        "title": "In-car gps navigation: engagement with and disengagement from the environment",
        "authors": "Gilly Leshed, Theresa Velden, Oya Rieger, Blazej Kot, Phoebe Sengers",
        "abstract": "Although in-car GPS navigation technology is proliferating, it is not well understood how its use alters the ways people interpret their environment and navigate through it. We argue that GPS-based car navigation might disengage people from their surrounding environment, but also has the potential to open up novel ways to engage with it. We present an ethnographically-informed study with GPS users, showing evidence for practices of disengagement as well as new opportunities for engagement, illustrating our findings using rich descriptions from the field. Grounded in our observations we propose design principles for GPS systems that support richer experiences of driving. We argue that for a fuller understanding of issues of disengagement and engagement with the environment we need to move beyond a focus on the (re)design of GPS devices, and point to future directions of work that embrace a broader perspective.",
        "session": "SESSION: Driving in My Car"
    },
    {
        "title": "In-car interaction using search-based user interfaces",
        "authors": "Stefan Graf, Wolfgang Spiessl, Albrecht Schmidt, Anneke Winter, Gerhard Rigoll",
        "abstract": "Increasing functionality, growing media volumes and dynamic data in today's in-vehicle information systems bear new challenges for user interaction design. Traditional hierarchical and menu-based interaction can only provide limited support while new search-based approaches are promising. In this work we assess different search techniques and search-based user interfaces. In particular we compare free search across all data items with categorized search. Our experiments with functional prototypes show that free search is more efficient and easier to use than searching within categories. Tests in a driving simulator show promising results regarding safety and workload. Means for alphanumeric input appear to be essential for an efficient and safe search interaction while driving.",
        "session": "SESSION: Driving in My Car"
    },
    {
        "title": "Multi-flick: an evaluation of flick-based scrolling techniques for pen interfaces",
        "authors": "Dzimitry Aliakseyeu, Pourang Irani, Andrés Lucero, Sriram Subramanian",
        "abstract": "",
        "session": "SESSION: Pointing and Flicking"
    },
    {
        "title": "Peephole pointing: modeling acquisition of dynamically revealed targets",
        "authors": "Xiang Cao, Jacky Jie Li, Ravin Balakrishnan",
        "abstract": "",
        "session": "SESSION: Pointing and Flicking"
    },
    {
        "title": "The effect of spring stiffness and control gain with an elastic rate control pointing device",
        "authors": "Géry Casiez, Daniel Vogel",
        "abstract": "",
        "session": "SESSION: Pointing and Flicking"
    },
    {
        "title": "CoScripter: automating & sharing how-to knowledge in the enterprise",
        "authors": "Gilly Leshed, Eben M. Haber, Tara Matthews, Tessa Lau",
        "abstract": "Modern enterprises are replete with numerous online processes. Many must be performed frequently and are tedious, while others are done less frequently yet are complex or hard to remember. We present interviews with knowledge workers that reveal a need for mechanisms to automate the execution of and to share knowledge about these processes. In response, we have developed the CoScripter system (formerly Koala [11]), a collaborative scripting environment for recording, automating, and sharing web-based processes. We have deployed CoScripter within a large corporation for more than 10 months. Through usage log analysis and interviews with users, we show that CoScripter has addressed many user automation and sharing needs, to the extent that more than 50 employees have voluntarily incorporated it into their work practice. We also present ways people have used CoScripter and general issues for tools that support automation and sharing of how-to knowledge.",
        "session": "SESSION: End-Users Sharing and Tailoring Software"
    },
    {
        "title": "The buzz: supporting user tailorability in awareness applications",
        "authors": "James R. Eagan, John T. Stasko",
        "abstract": "Information awareness applications offer the exciting potential to help people to better manage the data they encounter on a routine basis, but customizing these applications is a difficult task. Most applications allow users to perform basic customizations or programmers to create advanced ones. We present an intermediate customization space and Cocoa Buzz, an application that demonstrates one way to bridge these two extremes. Cocoa Buzz runs on an extra display on the user's desktop or on a large shared display and cycles through different information sources customized by the user. We further demonstrate some of the customizations that have been made using this approach. We show some preliminary evidence to suggest that this approach may be useful at providing users with the ability to perform customizations across this spectrum.",
        "session": "SESSION: End-Users Sharing and Tailoring Software"
    },
    {
        "title": "Photos on the go: a mobile application case study",
        "authors": "Mor Naaman, Rahul Nair, Vlad Kaplun",
        "abstract": "We designed and iterated on a photo browsing application for high-end mobile phones. The application, Zurfer, supports viewing of photos from the user, their contacts, and the general user population. Photos are organized using a channel metaphor, driven by multiple dimensions: social, spatial and topical. Zurfer was deployed to over 500 users; extensive user research was conducted with nine participants. The data from the deployment and the study exposes general themes of mobile application use, as well as requirements for mobile applications in the photos domain, mobile social applications, and entertainment-driven mobile applications.",
        "session": "SESSION: Picture Perfect"
    },
    {
        "title": "Photospread: a spreadsheet for managing photos",
        "authors": "Sean Kandel, Andreas Paepcke, Martin Theobald, Hector Garcia-Molina, Eric Abelson",
        "abstract": "PhotoSpread is a spreadsheet system for organizing and analyzing photo collections. It extends the current spreadsheet paradigm in two ways: (a) PhotoSpread accommodates sets of objects (e.g., photos) annotated with tags (attribute-value pairs). Formulas can manipulate object sets and refer to tags. (b) Photos can be reorganized (tags and location changed) by drag-and-drop operations on the spreadsheet. The PhotoSpread design was driven by the needs of field biologists who have large collections of annotated photos. The paper describes the PhotoSpread functionality and the design choices made.",
        "session": "SESSION: Picture Perfect"
    },
    {
        "title": "Picbreeder: evolving pictures collaboratively online",
        "authors": "Jimmy Secretan, Nicholas Beato, David B. D Ambrosio, Adelein Rodriguez, Adam Campbell, Kenneth O. Stanley",
        "abstract": "Picbreeder is an online service that allows users to collaboratively evolve images. Like in other Interactive Evolutionary Computation (IEC) programs, users evolve images on Picbreeder by selecting ones that appeal to them to produce a new generation. However, Picbreeder also offers an online community in which to share these images, and most importantly, the ability to continue evolving others' images. Through this process of branching from other images, and through continually increasing image complexity made possible by the NeuroEvolution of Augmenting Topologies (NEAT) algorithm, evolved images proliferate unlike in any other current IEC systems. Participation requires no explicit talent from the users, thereby opening Picbreeder to the entire Internet community. This paper details how Picbreeder encourages innovation, featuring images that were collaboratively evolved.",
        "session": "SESSION: Picture Perfect"
    },
    {
        "title": "Evaluating motion constraints for 3D wayfinding in immersive and desktop virtual environments",
        "authors": "Niklas Elmqvist, Mihail Eduard Tudoreanu, Philippas Tsigas",
        "abstract": "Motion constraints providing guidance for 3D navigation have recently been suggested as a way of offloading some of the cognitive effort of traversing complex 3D environments on a computer. We present findings from an evaluation of the benefits of this practice where users achieved significantly better results in memory recall and performance when given access to such a guidance method. The study was conducted on both standard desktop computers with mouse and keyboard, as well as on an immersive CAVE system. Interestingly, our results also show that the improvements were more dramatic for desktop users than for CAVE users, even outperforming the latter. Furthermore, the study indicates that allowing the users to retain local control over the navigation on the desktop platform helps them in familiarizing themselves with the 3D world.",
        "session": "SESSION: Finding your way"
    },
    {
        "title": "Navigation techniques for dual-display e-book readers",
        "authors": "Nicholas Chen, Francois Guimbretiere, Morgan Dixon, Cassandra Lewis, Maneesh Agrawala",
        "abstract": "Existing e-book readers do not do a good job supporting many reading tasks that people perform, as ethnographers report that when reading, people frequently read from multiple display surfaces. In this paper we present our design of a dual display e-book reader and explore how it can be used to interact with electronic documents. Our design supports embodied interactions like folding, flipping, and fanning for local/lightweight navigation. We also show how mechanisms like Space Filling Thumbnails can use the increased display space to aid global navigation. Lastly, the detachable faces in our design can facilitate inter-document operations and flexible layout of documents in the workspace. Semi-directed interviews with seven users found that dual-displays have the potential to improve the reading experience by supporting several local navigation tasks better than a single display device. Users also identified many reading tasks for which the device would be valuable. Users did not find the embodied interface particularly useful when reading in our controlled lab setting, however.",
        "session": "SESSION: Finding your way"
    },
    {
        "title": "Idea navigation: structured browsing for unstructured text",
        "authors": "Robin Stewart, Gregory Scott, Vladimir Zelevinsky",
        "abstract": "Traditional interfaces for information access do not fully support queries that rely on semantic relationships between terms. To better support such queries, we introduce a system that automatically extracts subject-verb-object concepts from unstructured text documents and dynamically presents them to the user as navigable refinements. This approach, which we call \"idea navigation,\" makes subject-verb-object querying as simple as selecting successive refinements. It also supports exploratory search by providing a view of the most common ideas in the current result set. First-time users of a prototype system successfully used idea navigation to solve realistic search tasks, demonstrating its effectiveness.",
        "session": "SESSION: Finding your way"
    },
    {
        "title": "Rendering navigation and information space with honeycomb™",
        "authors": "Sebastian Ryszard Kruk, Bill M Daniel",
        "abstract": "The growing amount of available information poses challenges not only in the process of information retrieval. The usability of the rendered search process and results can be increased by appropriate visualization techniques or new interaction paradigms, or both. In this article we present the HoneyComb™ paradigm, an information visualization style that aims to render and manage large quantities of information items. We describe the design objectives and the prototype of HC™. Finally, we present a short evaluation of the HC™ paradigm in the context of search and browsing.",
        "session": "SESSION: Finding your way"
    },
    {
        "title": "Activity sensing in the wild: a field trial of ubifit garden",
        "authors": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, James A. Landay",
        "abstract": "Recent advances in small inexpensive sensors, low-power processing, and activity modeling have enabled applications that use on-body sensing and machine learning to infer people's activities throughout everyday life. To address the growing rate of sedentary lifestyles, we have developed a system, UbiFit Garden, which uses these technologies and a personal, mobile display to encourage physical activity. We conducted a 3-week field trial in which 12 participants used the system and report findings focusing on their experiences with the sensing and activity inference. We discuss key implications for systems that use on-body sensing and activity inference to encourage physical activity.",
        "session": "SESSION: Personal Health"
    },
    {
        "title": "Healthcare in everyday life: designing healthcare services for daily life",
        "authors": "Stinne Aaløkke Ballegaard, Thomas Riisgaard Hansen, Morten Kyng",
        "abstract": "Today the design of most healthcare technology is driven by the considerations of healthcare professionals and technology companies. This has several benefits, but we argue that there is a need for a supplementary design approach on the basis the citizen and his or her everyday life. An approach where the main focus is to develop healthcare technology that fits the routines of daily life and thus allows the citizens to continue with the activities they like and have grown used to -- also with an aging body or when managing a chronic condition. Thus, with this approach it is not just a matter of fixing a health condition, more importantly is the matter of sustaining everyday life as a whole. This argument is a result from our work -- using participatory design methods -- on the development of supportive healthcare technology for elderly people and for diabetic, pregnant women.",
        "session": "SESSION: Personal Health"
    },
    {
        "title": "SuperBreak: using interactivity to enhance ergonomic typing breaks",
        "authors": "Dan Morris, A.J. Bernheim Brush, Brian R. Meyers",
        "abstract": "Repetitive strain injuries and ergonomics concerns have become increasingly significant health issues as a growing number of individuals frequently use computers for long periods of time. Currently, limited software mechanisms exist for managing ergonomics; the most well-known are \"break-reminder\" packages that schedule and recommend typing breaks. Yet despite the proven benefits of taking breaks, such packages are rarely adopted due to the over-head of introducing periodic interruptions into a user's workflow. In this paper, we describe SuperBreak, a break-reminder package that provides hands-free interactions during breaks, with the goal of encouraging users to take more breaks and enhancing the benefits of those breaks. In a field study of 26 knowledge workers, 85% preferred SuperBreak over a traditional break-reminder system, and on average participants took a higher percentage of the interactive breaks suggested to them. Our results highlight the value of interactivity for improving the adoption and retention of ergonomic break practices.",
        "session": "SESSION: Personal Health"
    }
]