[
    {
        "title": "NaviPoint: an input device for mobile information browsing",
        "authors": "Kiyokuni Kawachiya, Hiroshi Ishikawa",
        "abstract": ""
    },
    {
        "title": "The PadMouse: facilitating selection and spatial positioning for the non-dominant hand",
        "authors": "Ravin Balakrishnan, Pranay Patel",
        "abstract": ""
    },
    {
        "title": "Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces",
        "authors": "Beverly L. Harrison, Kenneth P. Fishkin, Anuj Gujar, Carlos Mochon, Roy Want",
        "abstract": ""
    },
    {
        "title": "Web page design: implications of memory, structure and scent for information retrieval",
        "authors": "Kevin Larson, Mary Czerwinski",
        "abstract": ""
    },
    {
        "title": "Exploring browser design trade-offs using a dynamical model of optimal information foraging",
        "authors": "Peter Pirolli",
        "abstract": ""
    },
    {
        "title": "Information archiving with bookmarks: personal Web space construction and organization",
        "authors": "David Abrams, Ron Baecker, Mark Chignell",
        "abstract": ""
    },
    {
        "title": "Triangles: tangible interface for manipulation and exploration of digital information topography",
        "authors": "Matthew G. Gorbet, Maggie Orth, Hiroshi Ishii",
        "abstract": ""
    },
    {
        "title": "HandJive: a device for interpersonal haptic entertainment",
        "authors": "BJ Fogg, Lawrence D. Cutler, Perry Arnold, Chris Eisbach",
        "abstract": ""
    },
    {
        "title": "Simplifying the controls of an interactive movie game",
        "authors": "Jeff Johnson",
        "abstract": ""
    },
    {
        "title": "Patterns of change in design metaphor: a case study",
        "authors": "William A. Stubblefield",
        "abstract": ""
    },
    {
        "title": "Netscape communicator's collapsible toolbars",
        "authors": "Irene Au, Shuang Li",
        "abstract": ""
    },
    {
        "title": "A study of fonts designed for screen display",
        "authors": "Dan Boyarski, Christine Neuwirth, Jodi Forlizzi, Susan Harkness Regli",
        "abstract": ""
    },
    {
        "title": "From documents to discourse: shifting conceptions of scholarly publishing",
        "authors": "Tamara Sumner, Simon Buckingham Shum",
        "abstract": ""
    },
    {
        "title": "The effects of distance in local versus remote human-computer interaction",
        "authors": "Youngme Moon",
        "abstract": ""
    },
    {
        "title": "Design evolution in a multimedia tutorial on user-centered design",
        "authors": "Tom Carey, Slade Mitchell, Dan Peerenboom, Mary Lytwyn",
        "abstract": ""
    },
    {
        "title": "Evaluating the location of hot spots in interactive scenes using the 3R toolbox",
        "authors": "Andre Plante, Shoji Tanaka, Seiki Inoue",
        "abstract": ""
    },
    {
        "title": "Providing advice for multimedia designers",
        "authors": "Pete Faraday, Alistair Sutcliffe",
        "abstract": ""
    },
    {
        "title": "101 spots, or how do users read menus?",
        "authors": "Antti Aaltonen, Aulikki Hyrskykari, Kari-Jouko Räihä",
        "abstract": ""
    },
    {
        "title": "Visual tracking for multimodal human computer interaction",
        "authors": "Jie Yang, Rainer Stiefelhagen, Uwe Meier, Alex Waibel",
        "abstract": ""
    },
    {
        "title": "When my face is the interface: an experimental comparison of interacting with one's own face or someone else's face",
        "authors": "Clifford Nass, Eun-Young Kim, Eun-Ju Lee",
        "abstract": ""
    },
    {
        "title": "Digital smart kiosk project",
        "authors": "Andrew D. Christian, Brian L. Avery",
        "abstract": ""
    },
    {
        "title": "Worldlets: 3D thumbnails for 3D browsing",
        "authors": "T. Todd Elvins, David R. Nadeau, Rina Schul, David Kirsh",
        "abstract": ""
    },
    {
        "title": "Evolving video skims into useful multimedia abstractions",
        "authors": "Michael G. Christel, Michael A. Smith, C. Roy Taylor, David B. Winkler",
        "abstract": ""
    },
    {
        "title": "Navigation guided by artificial force fields",
        "authors": "Dongbo Xiao, Roger Hubbold",
        "abstract": ""
    },
    {
        "title": "The design of guided learner-adaptable scaffolding in interactive learning environments",
        "authors": "Shari L. Jackson, Joseph Krajcik, Elliot Soloway",
        "abstract": ""
    },
    {
        "title": "ARTEMIS: learner-centered design of an information seeking environment for K-12 education",
        "authors": "Raven Wallace, Elliot Soloway, Joseph Krajcik, Nathan Bos, Joseph Hoffman, Heather Eccleston Hunter, Dan Kiskis, Elisabeth Klann, Greg Peters, David Richardson, Ofer Ronen",
        "abstract": ""
    },
    {
        "title": "Building an electronic learning community: from design to implementation",
        "authors": "Anne Rose, Wei Ding, Gary Marchionini, Josephus Beale, Jr., Victor Nolet",
        "abstract": ""
    },
    {
        "title": "Quantifying the effect of user interface design features on cyberstore traffic and sales",
        "authors": "Gerald L. Lohse, Peter Spiller",
        "abstract": ""
    },
    {
        "title": "Interactive advertising: patterns of use and effectiveness",
        "authors": "Kirsten Risden, Mary Czerwinski, Stephanie Worley, Lynda Hamilton, Joe Kubiniec, Hunter Hoffman, Nancy Mickel, Elizabeth Loftus",
        "abstract": ""
    },
    {
        "title": "Persuasive computers: perspectives and research directions",
        "authors": "BJ Fogg",
        "abstract": ""
    },
    {
        "title": "Student readers' use of library documents: implications for library technologies",
        "authors": "Kenton O'Hara, Fiona Smith, William Newman, Abigail Sellen",
        "abstract": ""
    },
    {
        "title": "A diary study of work-related reading: design implications for digital reading devices",
        "authors": "Annette Adler, Anuj Gujar, Beverly L. Harrison, Kenton O'Hara, Abigail Sellen",
        "abstract": ""
    },
    {
        "title": "Beyond paper: supporting active reading with free form digital ink annotations",
        "authors": "Bill N. Schilit, Gene Golovchinsky, Morgan N. Price",
        "abstract": ""
    },
    {
        "title": "Bullseye! when Fitts' law doesn't fit",
        "authors": "Naomi Friedlander, Kevin Schlueter, Marilyn Mantei",
        "abstract": ""
    },
    {
        "title": "Cognitive function analysis for human-centered automation of safety-critical systems",
        "authors": "Guy A. Boy",
        "abstract": ""
    },
    {
        "title": "Delegation and circumvention: two faces of efficiency",
        "authors": "Suresh K. Bhavnani, Bonnie E. John",
        "abstract": ""
    },
    {
        "title": "Digital manipulatives: new toys to think with",
        "authors": "Mitchel Resnick, Fred Martin, Robert Berg, Rick Borovoy, Vanessa Colella, Kwin Kramer, Brian Silverman",
        "abstract": ""
    },
    {
        "title": "When the interface is a talking dinosaur: learning across media with ActiMates Barney",
        "authors": "Erik Strommen",
        "abstract": ""
    },
    {
        "title": "PRoP: personal roving presence",
        "authors": "Eric Paulos, John Canny",
        "abstract": ""
    },
    {
        "title": "Coincident display using haptics and holographic video",
        "authors": "Wendy Plesniak, Ravikanth Pappu",
        "abstract": ""
    },
    {
        "title": "The structure of object transportation and orientation in human-computer interaction",
        "authors": "Yanqing Wang, Christine L. MacKenzie, Valerie A. Summers, Kellogg S. Booth",
        "abstract": ""
    },
    {
        "title": "Quantifying coordination in multiple DOF movement and its application to evaluating 6 DOF input devices",
        "authors": "Shumin Zhai, Paul Milgram",
        "abstract": ""
    },
    {
        "title": "An efficient text input method for pen-based computers",
        "authors": "Toshiyuki Masui",
        "abstract": ""
    },
    {
        "title": "A comparison of three selection techniques for touchpads",
        "authors": "I. Scott MacKenzie, Aleks Oniszczak",
        "abstract": ""
    },
    {
        "title": "A multiple device approach for supporting whiteboard-based interactions",
        "authors": "Jun Rekimoto",
        "abstract": ""
    },
    {
        "title": "The first noble truth of CyberSpace: people are people (even when they MOO)",
        "authors": "Diane J. Schiano, Sean White",
        "abstract": ""
    },
    {
        "title": "Are newsgroups virtual communities?",
        "authors": "Teresa L. Roberts",
        "abstract": ""
    },
    {
        "title": "Communication and information: alternative uses of the Internet in households",
        "authors": "Robert Kraut, Tridas Mukhopadhyay, Janusz Szczypula, Sara Kiesler, William Scherlis",
        "abstract": ""
    },
    {
        "title": "The Vista environment for the coevolutionary design of user interfaces",
        "authors": "Judy Brown, T. C. Nicholas Graham, Timothy Wright",
        "abstract": ""
    },
    {
        "title": "Tools for incremental development of educational software interfaces",
        "authors": "Wolff Daniel Dobson, Christopher K. Riesbeck",
        "abstract": ""
    },
    {
        "title": "Visual task characterization for automated visual discourse synthesis",
        "authors": "Michelle X. Zhou, Steven K. Feiner",
        "abstract": ""
    },
    {
        "title": "Visualizing the evolution of Web ecologies",
        "authors": "Ed H. Chi, James Pitkow, Jock Mackinlay, Peter Pirolli, Rich Gossweiler, Stuart K. Card",
        "abstract": ""
    },
    {
        "title": "Hi-cites: dynamically created citations with active highlighting",
        "authors": "Michelle Q. Wang Baldonado, Terry Winograd",
        "abstract": ""
    },
    {
        "title": "DIVA: exploratory data analysis with multimedia streams",
        "authors": "Wendy E. Mackay, Michel Beaudouin-Lafon",
        "abstract": ""
    },
    {
        "title": "National Geographic unplugged: classroom-centered design of interactive nature films",
        "authors": "Brian K. Smith, Brian J. Reiser",
        "abstract": ""
    },
    {
        "title": "New media, new practices: experiences in open learning course design",
        "authors": "Tamara Sumner, Josie Taylor",
        "abstract": ""
    },
    {
        "title": "Investigating the capture, integration and access problem of ubiquitous computing in an educational setting",
        "authors": "Gregory D. Abowd, Christopher G. Atkeson, Jason Brotherton, Tommy Enqvist, Paul Gulley, Johan LeMon",
        "abstract": ""
    },
    {
        "title": "Finding and visualizing inter-site clan graphs",
        "authors": "Loren Terveen, Will Hill",
        "abstract": ""
    },
    {
        "title": "Effects of interfaces for annotation on communication in a collaborative task",
        "authors": "Patricia G. Wojahn, Christine M. Neuwirth, Barbara Bullock",
        "abstract": ""
    },
    {
        "title": "Awareness driven video quality of service in collaborative virtual environments",
        "authors": "Gail Reynard, Steve Benford, Chris Greenhalgh, Christian Heath",
        "abstract": ""
    },
    {
        "title": "Supporting situated actions in high volume conversational data situations",
        "authors": "Christopher Lueg",
        "abstract": ""
    },
    {
        "title": "Heart rate variability: indicator of user state as an aid to human-computer interaction",
        "authors": "Dennis W. Rowe, John Sibert, Don Irwin",
        "abstract": ""
    },
    {
        "title": "Evolution of the conversation machine: a case study of bringing advanced technology to the marketplace",
        "authors": "Catherine G. Wolf, Wlodek Zadrozny",
        "abstract": ""
    },
    {
        "title": "Trust breaks down in electronic contexts but can be repaired by some initial face-to-face contact",
        "authors": "Elena Rocco",
        "abstract": ""
    },
    {
        "title": "Expertise, collaboration and bandwidth",
        "authors": "Alonso H. Vera, Thomas Kvan, Robert L. West, Simon Lai",
        "abstract": ""
    },
    {
        "title": "Effects of awareness support on groupware usability",
        "authors": "Carl Gutwin, Saul Greenberg",
        "abstract": ""
    },
    {
        "title": "Composing magic lenses",
        "authors": "David Fox",
        "abstract": ""
    },
    {
        "title": "Generalized pointing: enabling multiagent interaction",
        "authors": "Dan R. Olsen, Jr., Daniel Boyarski, Thom Verratti, Matthew Phelps, Jack L. Moffett, Edson L. Lo",
        "abstract": ""
    },
    {
        "title": "Scripting graphical applications by demonstration",
        "authors": "Brad A. Myers",
        "abstract": ""
    },
    {
        "title": "Illuminating light: an optical design tool with a luminous-tangible interface",
        "authors": "John Underkoffler, Hiroshi Ishii",
        "abstract": ""
    },
    {
        "title": "Insight lab: an immersive team environment linking paper, displays, and data",
        "authors": "Beth M. Lange, Mark A. Jones, James L. Meyers",
        "abstract": ""
    },
    {
        "title": "Reinventing the familiar: exploring an augmented reality design space for air traffic control",
        "authors": "Wendy E. Mackay, Anne-Laure Fayard, Laurent Frobert, Lionel Médini",
        "abstract": ""
    },
    {
        "title": "Designing audio aura",
        "authors": "Elizabeth D. Mynatt, Maribeth Back, Roy Want, Michael Baer, Jason B. Ellis",
        "abstract": ""
    },
    {
        "title": "Communicating graphical information to blind users using music: the role of context",
        "authors": "James L. Alty, Dimitrios I. Rigas",
        "abstract": ""
    },
    {
        "title": "What can I say?: evaluating a spoken language interface to Email",
        "authors": "Marilyn A. Walker, Jeanne Fromer, Giuseppe Di Fabbrizio, Craig Mestel, Don Hindle",
        "abstract": ""
    },
    {
        "title": "Device design methodology for trauma applications",
        "authors": "Diane S. Brown, Susan Motte",
        "abstract": ""
    },
    {
        "title": "Voice-enabled structured medical reporting",
        "authors": "Mary-Marshall Teel, Rachael Sokolowski, David Rosenthal, Matt Belge",
        "abstract": ""
    },
    {
        "title": "Interactive storytelling environments: coping with cardiac illness at Boston's Children's Hospital",
        "authors": "Marina Umaschi Bers, Edith Ackermann, Justine Cassell, Beth Donegan, Joseph Gonzalez-Heydrich, David Ray DeMaso, Carol Strohecker, Sarah Lualdi, Dennis Bromley, Judith Karlin",
        "abstract": ""
    },
    {
        "title": "Progressive design: staged evolution of scenarios in the design of a collaborative science learning environment",
        "authors": "George Chin, Jr., Mary Beth Rosson",
        "abstract": ""
    },
    {
        "title": "Adapting user interface design methods to the design of educational activities",
        "authors": "Clayton Lewis, Cathy Brand, Gina Cherry, Cyndi Rader",
        "abstract": ""
    },
    {
        "title": "The progress portfolio: designing reflective tools for a classroom context",
        "authors": "Ben Loh, Josh Radinsky, Eric Russell, Louis M. Gomez, Brian J. Reiser, Daniel C. Edelson",
        "abstract": ""
    }
]